{
  "title": "Date of publication xxxx 00, 0000, date of current version xxxx 00, 0000",
  "abstract": "Machine learning methods have achieved good performance and been widely applied in various real-world applications. They can learn the model adaptively and be better fit for special requirements of different tasks. Generally, a good machine learning system is composed of plentiful training data, a good model training process, and an accurate inference. Many factors can affect the performance of the machine learning process, among which the diversity of the machine learning process is an important one. The diversity can help each procedure to guarantee a total good machine learning: diversity of the training data ensures that the training data can provide more discriminative information for the model, diversity of the learned model (diversity in parameters of each model or diversity among different base models) makes each parameter/model capture unique or complement information and the diversity in inference can provide multiple choices each of which corresponds to a specific plausible local optimal result. Even though the diversity plays an important role in machine learning process, there is no systematical analysis of the diversification in machine learning system. In this paper, we systematically summarize the methods to make data diversification, model diversification, and inference diversification in the machine learning process, respectively. In addition, the typical applications where the diversity technology improved the machine learning performance have been surveyed, including the remote sensing imaging tasks, machine translation, camera relocalization, image segmentation, object detection, topic modeling, and others. Finally, we discuss some challenges of the diversity technology in machine learning and point out some directions in future work. Our analysis provides a deeper understanding of the diversity technology in machine learning tasks, and hence can help design and learn more effective models for real-world applications.",
  "introduction": "I. INTRODUCTION Traditionally, machine learning methods can learn model's parameters automatically with the training samples and thus it can provide models with good performances which can satisfy the special requirements of various applications. Actually, it has achieved great success in tackling many realworld artificial intelligence and data mining problems [1] , such as object detection [2] , [3] , natural image processing [5] , autonomous car driving [6] , urban scene understanding [7] , machine translation [4] , and web search/information retrieval [8] , and others. A success machine learning system often requires plentiful training data which can provide enough information to train the model, a good model learning process which can better model the data, and an accurate inference to discriminate different objects. However, in real-world applications, limited number of labelled training data are available. Besides, there exist large amounts of parameters in the machine learning model. These would make the \"over-fitting\" phenomenon in the machine learning process. Therefore, obtaining an accurate inference from the machine learning model tends to be a difficult task. Many factors can help to improve the performance of the machine learning process, among which the diversity in machine learning plays an important role. Diversity shows different concepts depending on context and application [39] . Generally, a diversified system contains more information and can better fit for various environments. It has already become an important property in many social fields, such as biological system, culture, products and so on. Particularly, the diversity property also has significant effects on the learning process of the machine learning system. Therefore, we wrote this survey mainly for two reasons. First, while the topic of diversity in machine learning methods has received attention for many years, there is no framework of diversity technology on general machine learning models. Although Kulesza et al. discussed the determinantal point processes (DPP) in machine learning which is only one of the measurements for diversity [39] . [11] mainly summarized the diversity-promoting methods for obtaining multiple diversified search results in the inference phase. Besides, [48] , [65] , [68] analyzed several methods on classifier ensembles, which represents only a specific form of ensemble learning. All these works do not provide a full survey of the topic, nor do they focus on machine learning with general forms. Our main aim is to provide such a survey, hoping to induce diversity in general machine learning process. As a second motivation, this survey is also useful to researchers working on designing effective learning process. Here, the diversity in machine learning works mainly on decreasing the redundancy between the data or the model and providing informative data or representative model in the machine learning process. This work will discuss the diversity property from different components of the machine learning process, including the training data, the learned model, and the inference. The diversity in machine learning tries to decrease the redundancy in the training data, the learned model as well as the inference and provide more information for machine learning process. It can improve the performance of the model and has played an important role in machine learning process. In this work, we summarize the diversification of machine learning into three categories: the diversity in training data (data diversification), the diversity of the model/models (model diversification) and the diversity of the inference (inference diversification). Data diversification can provide samples with enough information to train the machine learning model. The diversity in training data aims to maximize the information contained in the data. Therefore, the model can learn more information from the data via the learning process and the learned model can be better fit for the data. Many prior works have imposed the diversity on the construction of each training batch for the machine learning process to train the model more effectively [9] . In addition, diversity in active learning can also make the labelled training data contain the most information [13] , [14] and thus the learned model can achieve good performance with limited training samples. Moreover, in special unsupervised learning method by [38] , diversity of the pseudo classes can encourage the classes to repulse from each other and thus the learned model can provide more discriminative features from the objects. Model diversification comes from the diversity in human visual system. [16] - [18] have shown that the human visual system represents decorrelation and sparseness, namely diversity. This makes different neurons in the human learning respond to different stimuli and generates little redundancy in the learning process which ensures the high effectiveness of the human learning. However, general machine learning methods usually perform the redundancy in the learned model where different factors model the similar features [19] . Therefore, diversity between the parameters of the model (Dmodel) could significantly improve the performance of the machine learning systems. The D-model tries to encourage different parameters in each model to be diversified and each parameter can model unique information [20] , [21] . As a result, the performance of each model can be significantly improved [22] . However, general machine learning model usually provides a local optimal representation of the data with limited training data. Therefore, ensemble learning, which can learn multiple models simultaneously, becomes another hot machine learning methods to provide multiple choices and has been widely applied in many real-world applications, such as the speech recognition [24] , [25] , and image segmentation [27] . However, general ensemble learning usually makes the learned multiple base models converge to the same or similar local optima. Thus, diversity among multiple base models by ensemble learning (D-models) , which tries to repulse different base models and encourages each base model to provide choice reflecting multi-modal belief [23] , [26] , [27] , can provide multiple diversified choices and significantly improve the performance. Instead of learning multiple models with D-models, one can also obtain multiple choices in the inference phase, which is generally called multiple choice learning (MCL). However, the obtained choices from usual machine learning systems presents similarity between each other where the next choice will be one-pixel shifted versions of others [28] . Therefore, to overcome this problem, diversity-promoting prior can be imposed over the obtained multiple choices from the inference. Under the inference diversification, the model can provide choices/representations with more complement information [29] - [32] . This could further improve the performance of the machine learning process and provide multiple discriminative choices of the objects. This work systematically covers the literature on diversitypromoting methods over data diversification, model diversification, and inference diversification in machine learning tasks. In particular, three main questions from the analysis of diversity technology in machine learning have arisen. • How to measure the diversity of the training data, the learned model/models, and the inference and enhance these diversity in machine learning system, respectively? How do these methods work on the diversification of the machine learning system? • Is there any difference between the diversification of the model and models? Furthermore, is there any similarity between the diversity in the training data, the learned model/models, and the inference? • Which real-world applications can the diversity be applied in to improve the performance of the machine learning models? How do the diversification methods work on these applications? Although all of the three problems are important, none of them has been thoroughly answered. Diversity in machine learning can balance the training data, encourage the learned parameters to be diversified, and diversify the multiple choices from the inference. Through enforcing diversity in the machine learning system, the machine learning model can present a better performance. Following the framework, the three questions above have been answered with both the theoretical analysis and the real-world applications. The remainder of this paper is organized as Fig. 1 shows. Section II discusses the general forms of the supervised learning and the active learning as well as a special form of unsupervised learning in machine learning model. Besides, as Fig. 1 shows, Sections III, IV and V introduce the diversity methods in machine learning models. Section III outlines some of the prior works on diversification in training data. Section IV reviews the strategies for model diversification, including the D-model, and the D-models. The prior works for inference diversification are summarized in Section V. Finally, section VI introduces some applications of the diversity-promoting methods in prior works, and then we do some discussions, conclude the paper and point out some future directions.",
  "body": "I. INTRODUCTION Traditionally, machine learning methods can learn model's parameters automatically with the training samples and thus it can provide models with good performances which can satisfy the special requirements of various applications. Actually, it has achieved great success in tackling many realworld artificial intelligence and data mining problems [1] , such as object detection [2] , [3] , natural image processing [5] , autonomous car driving [6] , urban scene understanding [7] , machine translation [4] , and web search/information retrieval [8] , and others. A success machine learning system often requires plentiful training data which can provide enough information to train the model, a good model learning process which can better model the data, and an accurate inference to discriminate different objects. However, in real-world applications, limited number of labelled training data are available. Besides, there exist large amounts of parameters in the machine learning model. These would make the \"over-fitting\" phenomenon in the machine learning process. Therefore, obtaining an accurate inference from the machine learning model tends to be a difficult task. Many factors can help to improve the performance of the machine learning process, among which the diversity in machine learning plays an important role. Diversity shows different concepts depending on context and application [39] . Generally, a diversified system contains more information and can better fit for various environments. It has already become an important property in many social fields, such as biological system, culture, products and so on. Particularly, the diversity property also has significant effects on the learning process of the machine learning system. Therefore, we wrote this survey mainly for two reasons. First, while the topic of diversity in machine learning methods has received attention for many years, there is no framework of diversity technology on general machine learning models. Although Kulesza et al. discussed the determinantal point processes (DPP) in machine learning which is only one of the measurements for diversity [39] . [11] mainly summarized the diversity-promoting methods for obtaining multiple diversified search results in the inference phase. Besides, [48] , [65] , [68] analyzed several methods on classifier ensembles, which represents only a specific form of ensemble learning. All these works do not provide a full survey of the topic, nor do they focus on machine learning with general forms. Our main aim is to provide such a survey, hoping to induce diversity in general machine learning process. As a second motivation, this survey is also useful to researchers working on designing effective learning process. Here, the diversity in machine learning works mainly on decreasing the redundancy between the data or the model and providing informative data or representative model in the machine learning process. This work will discuss the diversity property from different components of the machine learning process, including the training data, the learned model, and the inference. The diversity in machine learning tries to decrease the redundancy in the training data, the learned model as well as the inference and provide more information for machine learning process. It can improve the performance of the model and has played an important role in machine learning process. In this work, we summarize the diversification of machine learning into three categories: the diversity in training data (data diversification), the diversity of the model/models (model diversification) and the diversity of the inference (inference diversification). Data diversification can provide samples with enough information to train the machine learning model. The diversity in training data aims to maximize the information contained in the data. Therefore, the model can learn more information from the data via the learning process and the learned model can be better fit for the data. Many prior works have imposed the diversity on the construction of each training batch for the machine learning process to train the model more effectively [9] . In addition, diversity in active learning can also make the labelled training data contain the most information [13] , [14] and thus the learned model can achieve good performance with limited training samples. Moreover, in special unsupervised learning method by [38] , diversity of the pseudo classes can encourage the classes to repulse from each other and thus the learned model can provide more discriminative features from the objects. Model diversification comes from the diversity in human visual system. [16] - [18] have shown that the human visual system represents decorrelation and sparseness, namely diversity. This makes different neurons in the human learning respond to different stimuli and generates little redundancy in the learning process which ensures the high effectiveness of the human learning. However, general machine learning methods usually perform the redundancy in the learned model where different factors model the similar features [19] . Therefore, diversity between the parameters of the model (Dmodel) could significantly improve the performance of the machine learning systems. The D-model tries to encourage different parameters in each model to be diversified and each parameter can model unique information [20] , [21] . As a result, the performance of each model can be significantly improved [22] . However, general machine learning model usually provides a local optimal representation of the data with limited training data. Therefore, ensemble learning, which can learn multiple models simultaneously, becomes another hot machine learning methods to provide multiple choices and has been widely applied in many real-world applications, such as the speech recognition [24] , [25] , and image segmentation [27] . However, general ensemble learning usually makes the learned multiple base models converge to the same or similar local optima. Thus, diversity among multiple base models by ensemble learning (D-models) , which tries to repulse different base models and encourages each base model to provide choice reflecting multi-modal belief [23] , [26] , [27] , can provide multiple diversified choices and significantly improve the performance. Instead of learning multiple models with D-models, one can also obtain multiple choices in the inference phase, which is generally called multiple choice learning (MCL). However, the obtained choices from usual machine learning systems presents similarity between each other where the next choice will be one-pixel shifted versions of others [28] . Therefore, to overcome this problem, diversity-promoting prior can be imposed over the obtained multiple choices from the inference. Under the inference diversification, the model can provide choices/representations with more complement information [29] - [32] . This could further improve the performance of the machine learning process and provide multiple discriminative choices of the objects. This work systematically covers the literature on diversitypromoting methods over data diversification, model diversification, and inference diversification in machine learning tasks. In particular, three main questions from the analysis of diversity technology in machine learning have arisen. • How to measure the diversity of the training data, the learned model/models, and the inference and enhance these diversity in machine learning system, respectively? How do these methods work on the diversification of the machine learning system? • Is there any difference between the diversification of the model and models? Furthermore, is there any similarity between the diversity in the training data, the learned model/models, and the inference? • Which real-world applications can the diversity be applied in to improve the performance of the machine learning models? How do the diversification methods work on these applications? Although all of the three problems are important, none of them has been thoroughly answered. Diversity in machine learning can balance the training data, encourage the learned parameters to be diversified, and diversify the multiple choices from the inference. Through enforcing diversity in the machine learning system, the machine learning model can present a better performance. Following the framework, the three questions above have been answered with both the theoretical analysis and the real-world applications. The remainder of this paper is organized as Fig. 1 shows. Section II discusses the general forms of the supervised learning and the active learning as well as a special form of unsupervised learning in machine learning model. Besides, as Fig. 1 shows, Sections III, IV and V introduce the diversity methods in machine learning models. Section III outlines some of the prior works on diversification in training data. Section IV reviews the strategies for model diversification, including the D-model, and the D-models. The prior works for inference diversification are summarized in Section V. Finally, section VI introduces some applications of the diversity-promoting methods in prior works, and then we do some discussions, conclude the paper and point out some future directions. II. GENERAL MACHINE LEARNING MODELS Traditionally, machine learning consists of supervised learning, active learning, unsupervised learning, and reinforcement learning. For reinforcement learning, training data is given only as the feedback to the program's actions in a dynamic environment, and it does not require accurate input/output pairs and the sub-optimal actions need not to be explicitly correct. However, the diversity technologies mainly work on the model itself to improve the model's performance. Therefore, this work will ignore the reinforcement learning and mainly discuss the machine learning model as Fig. 2 shows. In the following, we'll introduce the general forms of supervised learning and a representative form of active learning as well as a special form of unsupervised learning. A. SUPERVISED LEARNING We consider the task of general supervised machine learning models, which are commonly used in real-word machine learning tasks. Fig. 2 shows the flowchart of general machine learning methods in this work. As Fig. 2 shows, the supervised machine learning model consists of data preprocessing, training (modeling), and inference. All of the steps can affect the performance of the machine learning process. Let X = {x 1 , x 2 , • • • , x N1 } denote the set of training samples and y i is the corresponding label of x i , where y i ∈ Ω = {cl 1 , cl 2 , • • • , cl n } (Ω is the set of class labels, n is the number of the classes, and N 1 is the number of the labelled training samples). Traditionally, the machine learning task can be formulated as the following optimization problem [33] , [34] : max W L(W |X) s.t. g(W ) ≥ 0 (1) where L(W |X) represents the loss function and W is the parameters of the machine learning model. Besides, g(W ) ≥ 0 is the constraint of the parameters of the model. Then, the Lagrange multiplier of the optimization can be reformulated as follows. L 0 = L(W |X) + ηg(W ) (2) where η is a positive value. Therefore, the machine learning problem can be seen as the minimization of L 0 . Figs. 3 and 4 show the flowchart of two special forms of supervised learning models, which are generally used in realworld applications. Among them, Fig. 3 shows the flowchart of a special form of supervised machine learning with a single model. Generally, in the data-preprocessing stage, the more diversification and balance each training batch has, the more effectiveness the training process is. In addition, it should be noted that the factors in the same layer of the model can be diversified to improve the representational ability of the model (which is called D-model in this paper). Moreover, when we obtain multiple choices from the model in the inference, the obtained choices are desired to provide more complement information. Therefore, some works focus on the diversification of multiple choices (which we call inference diversification). Fig. 4 shows the flowchart of supervised machine learning with multiple parallel base models. We can find that a best strategy to diversify the training set for different base models can improve the performance of the whole ensemble (which is called D-models). Furthermore, we can diversify these base models directly to enforce each base model to provide more complement information for further analysis. B. ACTIVE LEARNING Since labelling is always cost and time consuming, it usually cannot provide enough labelled samples for training in real world applications. Therefore, active learning, which can reduce the label cost and keep the training set in a moderate size, plays an important role in the machine learning model [35] . It can make use of the most informative samples and VOLUME 4, 2016 Data Preprocessing Training Modeling Inference Active Learning Supervised Learning Unsupervised Learning labelled data unlabelled data Candidate Data FIGURE 2: Flowchart for training process of general machine learning (including the active learning, supervised learning and unsupervised learning). We can find that when the training data is labelled, the training process is supervised. In contrast, the training process is unsupervised. Besides, it should be noted that when both the labelled and unlabelled data are used for training, the training process is semi-supervised. Training Data Model Latent Parameter Factors Layer 1 Layer s Diversification Inference Choice 1 Choice 2 Choice M Data Preprocessing samples  Training batch  Data augmentation In addition, it should be noted that the factors in the same layer of the model can be diversified to improve the representational ability of the model (which is called D-model in this paper). Moreover, when we obtain multiple choices from the model, the obtained choices are desired to provide more complement information. Therefore, some works focus on the diversification of multiple choices (which we call inference diversification). provide a higher performance with less labelled training samples. Through active learning, we can choose the most informative samples for labelling to train the model. This paper will take the Convex Transductive Experimental Design (CTED) as a representative of the active learning methods [36] , [37] . Denote U = {u i } N2 i=1 as the candidate unlabelled samples for active learning, where N 2 represents the number of the candidate unlabelled samples. Then, the active learning problem can be formulated as the following optimization problem [37] : A * , b * = arg min A,b U -U A 2 F + N2 i=1 N2 j=1 a 2 ij b i + α b 1 s.t. b i ≥ 0, i = 1, 2, • • • , N 2 (3 ) where a ij is the (i, j)-th entry of A, and α is a positive tradeoff parameter. • F represents the Frobenius norm (F-norm) which calculates the root of the quadratic sum of the items in a matrix. As is shown, CTED utilizes a data reconstruction framework to select the most informative Training Data Subset 1 Subset 2 Subset M Choice 1 Choice 2 Choice M Model 1 Model 2 Model M Diversification FIGURE 4: Flowchart of supervised machine learning with multiple parallel models. We can find that a best strategy to diversify the training set for different models can improve the performance of multiple models. Furthermore, we can diversify different models directly to enforce different model to provide more complement information for further analysis. samples for labelling. The matrix A contains reconstruction coefficients and b is the sample selection vector. The L 1 -norm makes the learned b to be sparse. Then, the obtained b * is used to select samples for labelling and finally the training set is constructed with the selected training samples. However, the selected samples from CTED usually make similarity from each other, which leads to the redundancy of the training samples. Therefore, diversity property is also required in the active learning process. C. UNSUPERVISED LEARNING As discussed in former subsection, limited number of the training samples will limit the performance of the machine learning process. Instead of the active learning, to solve the problem, unsupervised learning methods provide another way to train the machine learning model without the labelled training samples. This work will mainly discuss a special unsupervised learning process developed by [38] , which is an end-to-end self-supervised method. Denote c i (i = 1, 2, • • • , Λ) as the center points which is used to formulate the pseudo classes in the training process where Λ represents the number of the pseudo classes. Just as subsection II-B, U = {u 1 , u 2 , • • • , u N2 } represents the unlabelled training samples and N 2 denotes the number of the unsupervised samples. Besides, denote ϕ(u i ) as the features of u i extracted from the machine learning model. Then, the pseudo label z i of the data u i can be defined as z i = min k∈{1,2,••• ,Λ} c k -ϕ(u i ) , (4) Then, the problem can be transformed to a supervised one with the pseudo classes. As shown in subsection II-A, the machine learning task can be formulated as the following optimization [38] max W,ci L(W |U, z i ) + ηg(W ) + N2 k=1 c z k -ϕ(u k ) (5) where L(W |U, z i (i = 1, 2, • • • , N 2 ) ) denotes the optimization term and N2 k=1 c z k -ϕ(u k ) is used to minimize the intra-class variance of the constructed pseudo-classes. g(W ) demonstrates the constraints in Eq. 2. With the iteratively learning of Eq. 4 and Eq. 5, the machine learning model can be trained unsupervisedly. Since the center points play an important role in the construction of the pseudo classes, diversifying these center points and repulsing the points from each other can better discriminate these pseudo classes. This would show positive effects on improving the effectiveness of the unsupervised learning process. D. ANALYSIS As former subsections show, diversity can improve the performance of the machine learning process. In the following, this work will summarize the diversification in machine learning from three aspects: data diversification, model diversification, and inference diversification. To be concluded, diversification can be used in supervised learning, active learning, and unsupervised learning to improve the model's performance. According to the models in II-A and II-B, the diversification technology in machine learning model has been divided into three parts: data diversification (Section III), model diversification (Section IV), and inference diversification (Section V). Since the diversification in training batch (Fig. 3 ) and the diversification in active learning and unsupervised learning mainly consider the diversification in training data, we summarize the prior works in these diversification as data diversification in section III. Besides, the diversification of the model in Fig. 3 and the multiple base models in Fig. 4 mainly focus on the diversification in the machine learning model directly, and thus we summarize these works as model diversification in section IV. Finally, the inference diversification in Fig. 3 will be summarized in section V. In the following section, we'll first introduce the data diversification in machine learning models. III. DATA DIVERSIFICATION Obviously, the training data plays an important role in the training process of the machine learning models. For supervised learning in subsection II-A, the training data provides more plentiful information for the learning of the parameters. While for active learning in subsection II-B, the learning process would select the most informative and less redundant samples for labelling to obtain a better performance. Besides, for unsupervised learning in subsection II-C, the pseudo classes can be encouraged to repulse from each other and the model can provide more discriminative features unsupervisedly. The following will introduce the methods for these data diversification in detail. A. DIVERSIFICATION IN SUPERVISED LEARNING General supervised learning model is usually trained with mini-batches to accurately estimate the training model. Most of the former works generate the mini-batches randomly. However, due to the imbalance of the training samples under random selection, redundancy may occur in the generated mini-batches which shows negative effects on the effectiveness of the machine learning process. Different from classical stochastic gradient descent (SGD) method which relies on the uniformly sampling data points to form a mini-batch, [9] , [10] proposes a non-uniformly sampling scheme based on the determinantal point process (DPP) measurement. A DPP is a distribution over subsets of a fixed ground set, which prefers a diverse set of data other than a redundant one [39] . Let Θ denote a continuous space and the data x i ∈ Θ(i = 1, 2, • • • , N 1 ). Then, the DPP denotes a positive semidefinite kernel function on Θ, φ : Θ × Θ → R P (X ∈ Θ) = det(φ(X)) det(φ + I) (6) where φ(X) denotes the kernel matrix and the pairwise φ(x i , x j ) is the pairwise correlation between the data x i and x j . det(•) denotes the determinant of matrix. I is an identity matrix. Since the space Θ is constant, det(φ + I) is a constant value. Therefore, the corresponding diversity prior of transition parameter matrix modeled by DPP can be formulated as P (X) ∝ det(φ(X)) In general, the kernel can be divided into the correlation and the prior part. Therefore, the kernel can be reformulated as φ(x i , x j ) = R(x i , x j ) π(x i )π(x j ) (8) where π(x i ) is the prior for the data x i and R(X) denotes the correlation of these data. These kernels would always induce repulsion between different points and thus a diverse set of points tends to have higher probability. Generally, the vectors are supposed to be uniformly distributed variables. Therefore, the prior π(x i ) is a constant value, and then, the kernel φ(x i , x j ) = R(x i , x j ). The DPPs provide a probability measure over every configuration of subsets on data points. Based on a similarity matrix over the data and a determinant operator, the DPP assigns higher probabilities to those subsets with dissimilar items. Therefore, it can give lower probabilities to mini-batches which contain the redundant data, and higher probabilities to mini-batches with more diverse data [9] . This simultaneously balances the data and generates the stochastic gradients with lower variance. Moreover, [10] further regularizes the DPP (R-DPP) with an arbitrary fixed positive semi-definite matrix inside of the determinant to accelerate the training process. Besides, [12] generalizes the diversification of the minibatch sampling to arbitrary repulsive point processes, such as the Stationary Poisson Disk Sampling (PDS). The PDS is one type of repulsive point process. It can provide point arrangements similar to DPP but with much more efficiency. The PDS indicates that the smallest distance between each pair of sample points should be at least r with respect to some distance measurement D(x i , x j ) [12] , such as the Euclidean distance and the heat kernel. The measurement can be formulated as Euclidean distance: D(x i , x j ) = x i -x j 2 (10) Heat kernel: D(x i , x j ) = e x i -x j 2 σ ( 11 ) where σ is a positive value. Given a new mini-batch B, and the algorithm of PDS can work as follows in each iteration. • Randomly select a data point x new . • If D(x new , x i ) ≤ r(∀x i ∈ B), throw out the point; otherwise add x new in batch B. The computational complexity of PDS is much lower than that of the DPP. Under these diversification prior, such as the DPP and the PDS, each mini-batch consists of the training samples with more diversity and information, which can train the model more effectively, and thus the learned model can exact more discriminative features from the objects. B. DIVERSIFICATION IN ACTIVE LEARNING As section II-B shows, active learning can obtain a good performance with less labelled training samples. However, some selected samples with CTED are similar to each other and contain the overlapping and redundant information. The highly similar samples make the redundancy of the training samples, and this further decreases the training efficiency, which requires more training samples for a comparable performance. To select more informative and complement samples with the active learning method, some prior works introduce the diversity in the selected samples obtained from CTED (Eq. 3) [13] , [14] . To promote diversity between the selected samples, [14] enhances CTED with a diversity regularizer min A,b U -U A 2 F + N2 i=1 N2 1 a 2 ij b i + α b 1 + γb T Sb s.t. b i ≥ 0, i = 1, 2, • • • , N 2 (12) where A = [a 1 , • • • , a N2 ], • represents the F-norm, and the similarity matrix S ∈ R N2×N2 is used to model the pairwise similarities among all the samples, such that larger value of s ij demonstrates the higher similarity between the i-th sample and the j-th one. Particularly, [14] chooses the cosine similarity measurement to formulate the diversity term. And the diversity term can be formulated as s ij = a i (a j ) T a i a j . (13) As [22] introduces, s ij tends to be zero when a i and a j tends to be uncorrelated. Similarly, [13] denotes the diversity term in active learning with the angular of the cosine similarity to obtain a diverse set of training samples. The diversity term can be formulated as s ij = π 2 -arccos( a i (a j ) T a i a j ). (14) Obviously speaking, when the two vectors become vertical, the vectors tend to be uncorrelated. Therefore, under the diversification, the selected samples would be more informative. Besides, [15] takes advantage of the well-known RBF kernel to measure the diversity of the selected samples, the diversity term can be calculated by s ij = a i -a j 2 σ 2 (15) where σ is a positive value. Different from Eqs. 13 and Eq. 14 which measure the diversity from the angular view, Eq. 15 calculates the diversity from the distance view. Generally, given two data, if they are similar to each other, the term will have a large value. Through adding diversity regularization over the selected samples by active learning, samples with more information and less redundancy would be chosen for labelling and then used for training. Therefore, the machine learning process can obtain comparable or even better performance with limited training samples than that with plentiful training samples. C. DIVERSIFICATION IN UNSUPERVISED LEARNING As subsection II-C shows, the unsupervised learning in [38] is based on the construction of the pseudo classes with the center points. By repulsing the center points from each other, the pseudo classes would be further enforced to be away from one another. If we encourage the center points to be diversified and repulse from each other, the learned features from different classes can be more discriminative. Generally, the Euclidean distance can be used to calculate the diversification of the center points. The pseudo label of x i is also calculated by Eq. 4. Then, the unsupervised learning method with the diversity-promoting prior can be formulated as max W,ci L(W |U, z i )+ηg(W )+ N2 k=1 c z k -u k +γ j =k c j -c k (16) where γ is a positive value which denotes the tradeoff between the optimization term and the diversity term. Under the diversification term, in the training process, the center points would be encouraged to repulse from each other. This makes the unsupervised learning process be more effective to obtain discriminative features from samples in different classes. IV. MODEL DIVERSIFICATION In addition to the data diversification to improve the performance with more informative and less redundant samples, we can also diversify the model to improve the representational ability of the model directly. As introduction shows, the machine learning methods aim to learn parameters by the machine itself with the training samples. However, due to the limited and imbalanced training samples, highly similar parameters would be learned by general machine learning process. This would lead to the redundancy of the learned model and negatively affect the model's representational ability. Therefore, in addition to the data diversification, one can also diversify the learned parameters in the training process and further improve the representational ability of the model (D-model). Under the diversification prior, each parameter factor can model unique information and the whole factors model a larger proportional of information [22] . Another method is to obtain diversified multiple models (D-models) through machine learning. Traditionally, if we train the multiple models separately, the obtained representations from different models would be similar and this would lead to the redundancy between different representations. Through regularizing the multiple base models with the diversification prior, different models would be enforced to repulse from each other and each base model can provide choices reflecting multi-modal belief [27] . In the following subsections, we'll introduce the diversity methods for D-model and Dmodels in detail separately. A. D-MODEL The first method tries to diversify the parameters of the model in the training process to directly improve the representational ability of the model. Fig. 5 shows the effects of D-model on improving the performance of the machine learning model. As Fig. 5 shows, under the D-model, each factor would model unique information and the whole factors model a larger proportional of information and then the information will be further improved. Traditionally, Bayesian method and posterior regularization method can be used to VOLUME 4, 2016 Model Diversification Machine learning model Parameters of the machine learning model Feature space of the data Model Diversification impose diversity over the parameters of the model. Different diversity-promoting priors have been developed in prior works to measure the diversity between the learned parameter factors according to the special requirements of different tasks. This subsection will mainly introduce the methods which can enforce the diversity of the model and summarize these methods occurred in prior works. 1) Bayesian Method Traditionally, diversity-promoting priors can be used to measure the diversification of the model. The parameters of the model can be calculated by the Bayesian method as W ∝ P (W |X) = P (X|W ) × P (W ) (17) where W = [w 1 , w 2 , • • • , w K ] denotes the parameters in the machine learning model, K is the number of the parameters, P (X|W ) represents the likelihood of the training set on the constructed model and P (W ) stands for the prior knowledge of the learned model. For the machine learning task at hand, P (W ) describes the diversity-promoting prior. Then, the machine learning task can be written as W * = arg max W P (W |X) = arg max W P (X|W ) × P (W ) (18) The log-likelihood of the optimization can be formulated as W * = arg max W (log P (X|W ) + log P (W )) (19) Then, Eq. 19 can be written as the following optimization max W log P (X|W ) + log P (W ) (20) where log P (X|W ) represents the optimization objective of the model, which can be formulated as L 0 in subsection II-A. TABLE 1: Overview of most frequently used diversification method in D-model and the papers in which example measurements can be found. Measurements Papers Cosine Similarity [19] , [20] , [22] , [43] , [44] , [46] , [47] , [125] , [134] - [137] Determinantal Point Process [39] , [87] , [92] , [114] , [121] - [123] , [127] , [129] -[132], [145]-[149] Submodular Spectral Diversity [54] Inner Product [43], [51] Euclidean Distance [40]-[42] Heat Kernel [2], [3], [143] Divergence [40] Uncorrelation and Evenness [55] L 2,1 [56]- [58] , [128] , [133] , [139] - [142] the diversity-promoting prior log P (W ) aims to encourage the learned factors to be diversified. With Eq. 20, the diversity prior can be imposed over the parameters of the learned model. 2) Posterior Regularization Method In addition to the former Bayesian method, posterior regularization methods can be also used to impose the diversity property over the learned model [138] . Generally, the regularization method can add side information into the parameter estimation and thus it can encourage the learned factors to possess a specific property. We can also use the posterior regularization to enforce the learned model to be diversified. The diversity regularized optimization problem can be formulated as max W L 0 + γf (W ) (21) where f (W ) stands for the diversity regularization which measures the diversity of the factors in the learned model. L 0 represents the optimization term of the model which can be seen in subsection II-A. γ demonstrates the tradeoff between the optimization and the diversification term. From Eqs. 20 and 21, we can find that the posterior regularization has the similar form as the Bayesian method. In general, the optimization (20) can be transformed into the form (21) . Many methods can be applied to measure the diversity property of the learned parameters. In the following, we will introduce different diversity priors to realize the Dmodel in detail. 3) Diversity Regularization As Fig. 5 shows, the diversity regularization encourages the factors to repulse from each other or to be uncorrelated. The key problem with the diversity regularization is the way to calculate the diversification of the factors in the model. Prior works mainly impose the diversity property into the machine learning process from six aspects, namely the distance, the angular, the eigenvalue, the divergence, the L 2,1 , and the DPP. The following will introduce the measurements and further discuss the advantages and disadvantages of these measurements. Distance-based measurements. The simplest way to formulate the diversity between different factors is the Euclidean distance. Generally, enlarging the distances between different factors can decrease the similarity between these factors. Therefore, the redundancy between the factors can be decreased and the factors can be diversified. [40] - [42] have applied the Euclidean distance as the measurements to encourage the latent factors in machine learning to be diversified. In general, the larger of the Euclidean distance two vectors have, the more difference the vectors are. Therefore, we can diversify different vectors through enlarging the pairwise Euclidean distances between these vectors. Then, the diversity regularization by Euclidean distance from Eq. 21 can be formulated as f (W ) = K i =j w i -w j 2 ( 22 ) where K is the number of the factors which we intend to diversify in the machine learning model. Since the Euclidean distance uses the distance between different factors to measure the similarity of these factors , generally the regularizer in Eq. 22 is variant to scale due to the characteristics of the distance. This may decrease the effectiveness of the diversity measurement and cannot fit for some special models with large scale range. Another commonly used distance-based method to encourage diversity in the machine learning is the heat kernel [2] , [3] , [143] . The correlation between different factors is formulated through Gaussian function and it can be calculated as f (w i , w j ) = -e -w i -w j 2 σ ( 23 ) where σ is a positive value. The term measures the correlation between different factors and we can find that when w i and w j are dissimilar, f (w i , w j ) tends to zero. Then, the diversity-promoting prior by the heat kernel from Eq. 20 can be formulated as P (W ) = e -γ K i =j e - w i -w j 2 σ ( 24 ) The corresponding diversity regularization form can be formulated as f (W ) = - K i =j e -w i -w j 2 σ ( 25 ) where σ is a positive value. Heat kernel takes advantage of the distance between the factors to encourage the diversity of the model. It can be noted that the heat kernel has the form of Gaussian function and the weight of the diversity penalization is affected by the distance. Thus, the heat kernel presents more variance with the penalization and shows better performance than general Euclidean distance. All the former distance-based methods encourage the diversity of the model by enforcing the factors away from each other and thus these factors would show more difference. However, it should be noted that the distance-based measurements can be significantly affected by scaling which can limit the performance of the diversity prior over the machine learning. Angular-based measurements. To make the diversity measurement be invariant to scale, some works take advantage of the angular to encourage the diversity of the model. Among these works, the cosine similarity measurement is the most commonly used [20] , [22] . Obviously, the cosine similarity can measure the similarity between different vectors. In machine learning tasks, it can be used to measure the redundancy between different latent parameter factors [19] , [20] , [22] , [43] , [44] . The aim of cosine similarity prior is to encourage different latent factors to be uncorrelated, such that each factor in the learned model can model unique features from the samples. The cosine similarity between different factors w i and w j can be calculated as [45] , [46] c ij = < w i , w j > w i w j , i = j, 1 ≤ i, j = K (26) Then, the diversity-promoting prior of generalized cosine similarity measurement from Eq. 20 can be written as P (W ) ∝ e -γ( i =j c p ij ) 1 p (27) It should be noted that when p is set to 1, the diversitypromoting prior over different vectors w i (i = 1, 2, • • • , K) by cosine similarity from Eq. 20 can be formulated as P (W ) ∝ e -γ i =j cij ( 28 ) where γ is a positive value. It can be noted that under the diversity-promoting prior in Eq. 28, the c ij is encouraged to be 0. Then, w i and w j tend to be orthogonal and different factors are encouraged to be uncorrelated and diversified. Besides, the diversity regularization form by the cosine similarity measurement from Eq. 21 can be formulated as f (W ) = - K i =j < w i , w j > w i w j (29) However, there exist some defects in the former measurement where the measurement is variant to orientation. To overcome this problem, many works use the angular of cosine similarity to measure the diversity between different factors [19] , [21] , [47] . Since the angular between different factors is invariant to translation, rotation, orientation and scale, [19] , [21] , [47] develops the angular-based diversifying method for Restricted Boltzmann Machine (RBM). These works use the variance and mean value of the angular between different factors to formulate the diversity of the model to overcome the problem occurred in cosine similarity. The angular between different factors can be formulated as Γ ij = arccos < w i , w j > w i w j (30) Since we do not care about the orientation of the vectors just as [21] , we prefer the angular to be acute or right. From the mathematical view, two factors would tend to be uncorrelated when the angular between the factors enlarges. Then, the diversity function can be defined as [21] , [48] - [50] f (W ) = Ψ(W ) -Π(W ) (31) where Ψ(W ) = 1 K 2 i =j Γ ij , Π(W ) = 1 K 2 i =j (Γ ij -Ψ(W )) 2 . In other words, Ψ(W ) denotes the mean of the angular between different factors and Π(W ) represents the variance of the angular. Generally, a larger f (W ) indicates that the weight vectors in W are more diverse. Then, the diversity promoting prior by the angular of cosine similarity measurement can be formulated as P (W ) ∝ e γf (W ) (32) The prior in Eq. 32 encourages the angular between different factors to approach π 2 , and thus these factors are enforced to be diversified under the diversification prior. Moreover, the measurement is invariant to scale, translation, rotation, and orientation. Another form of the angular-based measurements is to calculate the diversity with the inner product [43] , [51] . Different vectors present more diversity when they tend to be more orthogonal. The inner product can measure the orthogonality between different vectors and therefore it can be applied in machine learning models for more diversity. The general form of diversity-promoting prior by inner product measurement can be written as [43] , [51] P (W ) = e -γ K i =j <wi,wj > . ( 33 ) Besides, [63] uses the special form of the inner product measurement, which is called exclusivity. The exclusivity between two vectors w i and w j is defined as χ(w i , w j ) = w i w j 0 = m k=1 w i (k) • w j (k) (34) where denotes the Hadamard product, and • 0 denotes the L 0 norm. Therefore, the diversity-promoting prior can be written as P (W ) = e -γ K i =j wi wj 0 (35) Due to the non-convexity and discontinuity of L 0 norm, the relaxed exclusivity is calculated as [63] χ r (w i , w j ) = w i w j 1 = m k=1 |w i (k)| • |w j (k)| (36) where • 1 denotes the L 1 norm. Then, the diversitypromoting prior based on relaxed exclusivity can be calculated as P (W ) = e -γ K i =j wi wj 1 (37) The inner product measurement takes advantage of the characteristics among the vectors and tries to encourage different factors to be orthogonal to enforce the learned factors to be diversified. It should be noted that the measurement can be seen as a special form of cosine similarity measurement. Even though the inner product measurement is variant to scale and orientation, in many real-world applications, it is usually considered first to diversify the model since it is easier to implement than other measurements. Instead of the distance-based and angular-based measurements, the eigenvalues of the kernel matrix can also be used to encourage different factors to be orthogonal and diversified. Recall that, for an orthogonal matrix, all the eigenvalues of the kernel matrix are equal to 1. Here, we denote κ(W ) = W W T as the kernel matrix of W . Therefore, when we constrain the eigenvalues to 1, the obtained vectors would tend to be orthogonal [52] , [53] . Three ways are generally used to encourage the eigenvalues to approach constant 1, including the submodular spectral diversity (SSD) measurement, the uncorrelation and evenness measurement, and the log-determinant divergence (LDD). In the following, the two form of the eigenvalue-based measurements will be introduced in detail. Eigenvalue-based measurements. As the former denotes, κ(W ) = W W T stands for the kernel matrix of the latent factors. Two commonly used methods to promote diversity in the machine learning process based on the kernel matrix would be introduced. The first method is the submodular spectral diversity (SSD), which is based on the eigenvalues of the kernel matrix. [54] introduces the SSD measurement in the process of feature selection, which aims to select a diverse set of features. Feature selection is a key component in many machine learning settings. The process involves choosing a small subset of features in order to build a model to approximate the target concept well. The SSD measurement uses the square distance to encourage the eigenvalues to approach 1 directly. Define (λ 1 , λ 2 , • • • , λ K ) as the eigenvalues of the kernel matrix. Then, the diversity-promoting prior by SSD from Eq. 20 can be formulated as [54] P (W ) = e -γ K i=1 (λi(κ(W ))-1) 2 (38) where γ is also a positive value. From Eq. 21, the diversity regularization f (W ) can be formulated as f (W ) = - K i=1 (λ i (κ(W )) -1) 2 (39) This measurement regularizes the variance of the eigenvalues of the matrix. Since all the eigenvalues are enforced to approach 1, the obtained factors tend to be more orthogonal and thus the model can present more diversity. Another diversity measurement based on the kernel matrix is the uncorrelation and evenness [55] . This measurement encourages the learned factors to be uncorrelated and to play equally important roles in modeling data. Formally, this amounts to encouraging the kernel matrix of the vectors to have more uniform eigenvalues. The basic idea is to normalize the eigenvalues into a probability simplex and encourage the discrete distribution parameterized by the normalized eigenvalues to have small Kullback-Leibler (KL) divergence with the uniform distribution [55] . Then, the diversity-promoting prior by uniform eigenvalues from Eq. 20 is formulated as P (W ) = e -γ( tr(( 1 d κ(W )) log( 1 d κ(W ))) tr( 1 d κ(W )) -log tr( 1 d κ(W ))) (40) subject to κ(W ) 0 ( κ(W ) is positive definite matrix) and W 1 = 0, where κ(W ) is the kernel matrix. Besides, the diversity-promoting uniform eigenvalue regularizer (UER) from Eq. 21 is formulated as f (W ) = -[ tr(( 1 d κ(W )) log( 1 d κ(W ))) tr( 1 d κ(W )) -log tr( 1 d κ(W ))] (41) where d is the dimension of each factor. Besides, [53] takes advantage of the log-determinant divergence (LDD) to measure the similarity between different factors. The diversity-promoting prior in [53] combines the orthogonality-promoting LDD regularizer with the sparsitypromoting L 1 regularizer. Then, the diversity-promoting prior from Eq. 20 can be formulated as P (W ) = e -γ(tr(κ(W ))-log det(κ(W ))+τ |W |1) (42) where tr(•) denotes the matrix trace. Then, the corresponding regularizer from Eq. 21 is formulated as f (W ) = -(tr(κ(W )) -log det(κ(W )) + τ |W | 1 )). ( 43 ) The LDD-based regularizer can effectively promote nonoverlap [53] . Under the regularizer, the factors would be sparse and orthogonal simultaneously. These eigenvalue-based measurements calculate the diversity of the factors from the kernel matrix view. They not only consider the pairwise correlation between the factors, but also take the multiple correlation into consideration. Therefore, they generally present better performance than the distance-based and angular-based methods which only consider the pairwise correlation. However, the eigenvaluebased measurements would cost more computational sources in the implementation. Moreover, the gradient of the diversity term which is used for back propagation would be complex to compute and usually requires special processing methods, such as projected gradient descent algorithm [55] for the uncorrelation and evenness. DPP measurement. Instead of the eigenvalue-based measurements, another measurement which takes the multiple correlation into consideration is the determinantal point process (DPP) measurement. As subsection III-A shows, the DPP on the parameter factors W has the form as P (W ) ∝ det(φ(W )). (44) Generally, it can encourage the learned factors to repulse from each other. Therefore, the DPP-based diversifying prior can obtain machine learning models with a diverse set of the learned factors other than a redundant one. Some works have shown that the DPP prior is usually not arbitrarily strong for some special case when applied into machine learning models [60] . To encourage the DPP prior strong enough for all the training data, the DPP prior is augmented by an additional positive parameter γ. Therefore, just as section III-A, the DPP prior can be reformulated as P (W ) ∝ det(φ(W )) γ (45) where φ(W ) denotes the kernel matrix and φ(w i , w j ) demonstrates the pairwise correlation between w i and w j . The learned factors are usually normalized, and thus the optimization for machine learning can be written as max W log P (X|W ) + γ log(det(φ(W ))) (46) where f (W ) = log(det(φ(W ))) represents the diversity term for machine learning. It should be noted that different kernels can be selected according to the special requirements of different machine learning tasks [61] , [62] . For example, in [62] , the similarity kernel is adopted for the DPP prior which can be formulated as φ(w i , w j ) = < w i , w j > w i w j . ( 47 ) When we set the cosine similarity as the correlation kernel φ, from geometric interpretation, the DPP prior P (W ) ∝ det(φ(W )) can be seen as the volume of the parallelepiped spanned by the columns of W [39] . Therefore, diverse sets are more probable because their feature vectors are more orthogonal, and hence span larger volumes. It should be noted that most of the diversity measurements consider the pairwise correlation between the factors and ignore the multiple correlation between three or more factors. While the DPP measurement takes advantage of the merits of the DPP to make use of the multiple correlation by calculating the similarity between multiple factors. L 2,1 measurement. While all the former measurements promote the diversity of the model from the pairwise or multiple correlation view, many prior works prefer to use the L 2,1 for diversity since L 2,1 can take advantage of the group-wise correlation and obtain a group-wise sparse representation of the latent factors W [56]- [59] . It is well known that the L 2,1 -norm leads to the group-wise sparse representation of W . L 2,1 can also be used to measure the correlation between different parameter factors and diversify the learned factors to improve the representational ability of the model. Then, the L 2,1 prior from Eq. 20 can be calculated as P (W ) = e -γ K i ( n j |wi(j)|) 2 (48) where w i (j) means the j-th entry of w i . The internal L 1 norm encourages different factors to be sparse, while the external L 2 norm is used to control the complexity of entire model. Besides, the diversity term based on f (W ) from Eq. 21 can be formulated as f (W ) = - K i ( n j |w i (j)|) 2 ( 49 ) where n is the dimension of each factor w i . The internal L 1 -norm encourages different factors to be sparse, while the external L 2 -norm is used to control the complexity of entire model. In most of the machine learning models, the parameters of the model can be looked as the vectors and diversity of these factors can be calculated from the mathematical view just as these former measurements. When the norm of the vectors are constrained to constant 1, we can also take these factors as the probability distribution. Then, the diversity between the factors can be also measured from the Bayesian view. Divergence measurement. Traditionally, divergence, which is generally used Bayesian method to measure the difference between different distributions, can be used to promote diversity of the learned model [40] . Each factor is processed as a probability distribution firstly. Then, the divergence between factors w i and w j can be calculated as D(w i w j ) = n k=1 (w i (k) log w i (k) w j (k) -w i (k) + w j (k)) (50) subject to w i = 1. The divergence can measure the dissimilarity between the learned factors, such that the diversity-promoting regularization by divergence from Eq. 21 can be formulated as [40] f (W ) = K i =j D(w i w j ) = K i =j n k=1 (w i (k) log w i (k) w j (k) -w i (k) + w j (k)) (51) The measurement takes advantage of the characteristics of the divergence to measure the dissimilarity between different distributions. However, the norm of the learned factors need to satisfy w i = 1 which limits the application field of the diversity measurement. In conclusion, there are numerous approaches to diversify the learned factors in machine learning models. A summary of the most frequently encountered diversity methods is shown in Table 1 . Although most papers use slightly different specifications for their diversification of the learned model, the fundamental representation of the diversification is similar. It should also be noted that the thing in common among the studied diversity methods is that the diversity enforced in a pairwise form between members strikes a good balance between complexity and effectiveness [63] . In addition, different applications should choose the proper diversity measurements according to the specific requirements of different machine learning tasks. 4) Analysis These diversity measurements can calculate the similarity between different vectors and thus encourage the diversity of the machine learning model. However, there exists the difference between these measurements. The details of these diversity measurements can be seen in Table 2 . It can be noted from the table that all these methods take advantage of the pairwise correlation except L 2,1 which uses the groupwise correlation between different factors. Moreover, the determinantal point process, submodular spectral diversity, and uncorrelation and evenness can also take advantage of correlation among three or more factors. Another property of these diversity measurement is scale invariant. Scale invariant can make the diversity of the model be invariant w.r.t. the norm of these factors. The cosine similarity measurement calculates the diversity via the angular between different vectors. As a special case for DPP, the cosine similarity can be used as the correlation term R(w i , w j ) in DPP and thus the DPP measurement is scale invariant. Besides, for divergence measurement, since the factors are constrained with w i = 1, the measurement is scale invariant. These measurements can encourage diversity within different vectors. Generally, the machine learning models can be looked as the set of latent parameter factors, which can be represented as the vectors. These factors can be learned and used to represent the objects. In the following, we'll mainly summarize the methods to diversify the ensemble learning (D-models) for better performance of machine learning tasks. B. D-MODELS The former subsection introduces the way to diversify the parameters in single model and improve the representational ability of the model directly. Much efforts have been done to obtain the highest probability configuration of the machine learning models in prior works. However, even when the training samples are sufficient, the maximum a posteriori (MAP) solution could also be sub-optimal. In many situations, one could benefit from additional representations with multiple models. As Fig. 4 shows, ensemble learning (the way for training multiple models) has already occurred in many prior works. However, traditional ensemble learning methods to train multiple models may provide representations that tend to be similar while the representations obtained from different models are desired to provide complement information. Recently, many diversifying methods have been proposed to overcome this problem. As Fig. 6 shows, under the model diversification, each base model of the en-  semble can produce different outputs reflecting multi-modal belief. Therefore, the whole performance of the machine learning model can be improved. Especially, the D-models play an important role in structured prediction problems with multiple reasonable interpretations, of which only one is the groundtruth [27] . Denote W i (i = 1, 2, • • • , s) and P (W i ) as the parameters and the inference from the ith model where s is the number of the parallel base models. Then, the optimization of the machine learning to obtain multiple models can be written as max W1,W2,••• ,Ws s i=1 L(W i |X i ) (52) where L(W i |X i ) represents the optimization term of the ith model and X i denotes the training samples of the ith model. Traditionally, the training samples are randomly divided into multiple subsets and each subset trains a corresponding model. However, selecting subsets randomly may lead to the redundancy between different representations. Therefore, the first way to obtain multiple diversified models is to diversify these training samples over different base models, which we call sample-based methods. Another way to encourage the diversification between different models is to measure the similarity between different base models with a special similarity measurement and encourage different base models to be diversified in the training process, which is summarized as the optimizationbased methods. The optimization of these methods can be written as max W1,W2,••• ,Ws s i=1 L(W i |X) + γΓ(W 1 , W 2 , • • • , W s ) (53) where Γ(W 1 , W 2 , • • • , W s ) measures the diversification between different base models. These methods are similar to the methods for D-model in former subsection. Finally, some other methods try to obtain large amounts of models and select the top-L models as the final ensemble, which is called the ranking-based methods in this work. In the following, we'll summarize different methods for diversifying multiple models from the three aspects in detail. 1) Optimization-Based Methods Optimization-based methods are one of the most commonly used methods to diversify multiple models. These methods try to obtain multiple diversified models by optimizing a given objective function as Eq. 53 shows, which includes VOLUME 4, 2016 a diversity measurement. Just as the diversity of D-model in prior subsection, the main problem of these methods is to define diversity measurements which can calculate the difference between different models. Many prior works [48] , [64] - [68] have summarized some pairwise diversity measurements, such as Q-statistics measure [48] , [69] , correlation coefficient measure [48] , [69] , disagreement measure [64] , [70] , [127] , double-fault measure [64] , [71] , [127] , k statistic measure [72] , Kohavi-Wolpert variance [65] , [127] , inter-rater agreement [65] , [127] , the generalized diversity [65] and the measure of \"Difficult\" [65] , [127] . Recently, some more measurements have also been developed, including not only the pairwise diversity measurement [26] , [66] , [69] but also the measurements which calculate the multiple correlation and others [58] , [73] - [75] . This subsection will summarize these methods systematically. Bayesian-based measurements. Similar to D-model, Bayesian methods can also be applied in D-models. Among these Bayesian methods, divergence is the most commonly used one. As former subsection shows, the divergence can measure the difference between different distributions. The way to formulate the diversity-promoting term by the divergence method over the ensemble learning is to calculate the divergence between different distributions from the inference of different models, respectively [26] , [69] . The diversitypromoting term by divergence from Eq. 53 can be formulated as Γ(W 1 , W 2 , • • • ,W s ) = s i,j n k=1 (P (W i (k)) log P (W i (k)) P (W j (k)) -P (W i (k)) + P (W j (k))) (54) where W i (k) represents the k-th entry in W i . P (w i ) denotes the distributions of the inference from the i-th model. The former diversity term can increase the difference between the inference obtained from different models and would encourage the learned multiple models to be diversified. In addition to the divergence measurements, Renyientropy which measures the kernelized distances between the images of samples and the center of ensemble in the highdimensional feature space can also be used to encourage the diversity of the learned multiple models [76] . The Renyientropy is calculated based on the Gaussian kernel function and the diversity-promoting term from Eq. 53 can be formulated as Γ(W 1 , W 2 , • • • , W s ) = -log[ 1 s 2 s i=1 s j=1 G(P (W i ) -P (W j ), 2σ 2 )] ( 55 ) where σ is a positive value and G(•) represents the Gaussian kernel function, which can be calculated as G(W i -W j ,2σ 2 ) = 1 (2π) d 2 σ d exp{- (P (W i ) -P (W j )) T (P (W i ) -P (W j )) 2σ 2 } (56) where d denotes the dimension of W i . Compared with the divergence measurement, the Renyi-entropy measurement can be more fit for the machine learning model since the difference can be adapted for different models with different value σ. However, the Renyi-entropy would cost more computational sources and the update of the ensemble would be more complex. Another measurement which is based on the Bayesian method is the cross entropy measurement [77] , [78] , [124] . The cross entropy measurement uses the cross entropy between pairwise distributions to encourage two distributions to be dissimilar and then different base models could provide more complement information. Therefore, the cross-entropy between different base models can be calculated as Γ(w i , w j ) = 1 n n k=1 (P k (w i ) log P k (w j ) + (1 -P k (w i )) log(1 -P k (w j ))) (57) where P (W i ) is the inference of the i-th model and P k (W i ) is the probability of the sample belonging to the kth class. According to the characteristics of the cross entropy and the requirement of the diversity regularization, the diversitypromoting regularization of the cross entropy from Eq. 53 can be formulated as Γ(w 1 , w 2 , • • • , w K ) = 1 n s i,j n k=1 (P k (w i ) log P k (w j ) + (1 -P k (w i )) log(1 -P k (w j ))) (58) We all know that the larger the cross entropy is, the more difference the distributions are. Therefore, under the cross entropy measurement, different models can be diversified and provide more complement information. Most of the former Bayesian methods promote the diversity in the learned multiple base models by calculating the pairwise difference between these base models. However, these methods ignore the correlation among three or more base models. To overcome this problem, [75] proposes a hierarchical pair competition-based parallel genetic algorithm (HFC-PGA) to increase the diversity among the component neural networks. The HFC-PGA takes advantage of the average of all the distributions from the ensemble to calculate the difference of each base model. The diversity term by HFC-PGA from Eq. 53 can be formulated as Γ(W 1 , W 2 , • • • , W s ) = s j=1 ( 1 s s i=1 P (W i )-P (W j )) 2 (59) It should be noted that the HFC-PGA takes advantage of multiple correlation between the multiple models. However, the HFC-PGA method uses the fix weight to calculate the mean of the distributions and further calculate the covariance of the multiple models which usually cannot fit for different tasks. This would limit the performance of the diversity promoting prior. To deal with the shortcomings of the HFC-PGA, negative correlation learning (NCL) tries to reduce the covariance among all the models while the variance and bias terms are not increased [73] , [74] , [82] , [83] . The NCL trains the base models simultaneously in a cooperative manner that decorrelates individual errors. The penalty term can be designed in different ways depending on whether the models are trained sequentially or parallelly. [82] uses the penalty to decorrelate the current learning model with all previously learned models Γ(W 1 , W 2 , • • • , W s ) = s k=1 (P (W k ) -l) k-1 j=1 (P (W j ) -l) (60) where l represents the target function which is a desired output scalar vector. Besides, define P = s i=1 α i P (W i ) where s i=1 α i = 1. Then, the penalty term can also be defined to reduce the correlation mutually among all the learned models by using the actual distribution P obtained from each model instead of the target function l [68] , [73] , [74] . Γ(W 1 , W 2 , • • • , W s ) = s k=1 (P (W k ) -P ) k-1 j=1 (P (W j ) -P ) (61) This measurement uses the covariance of the inference results obtained from the multiple models to reduce the correlation mutually among the learned models. Therefore, the learned multiple models can be diversified. In addition, [84] further combines the NCL with sparsity. The sparsity is purely pursued by the L 1 norm regularization without considering the complementary characteristics of the available base models. Most of the Bayesian methods promote diversity in ensemble learning mainly by increasing the difference between the probability distributions of the inference of different base models. There exist other methods which can promote diversity over the parameters of each base model directly. Cosine similarity measurement. Different from the Bayesian methods which promote diversity from the distribution view, [66] introduces the cosine similarity measurements to calculate the difference between different models from geometric view. Generally, the diversity-promoting term from Eq. 53 can be written as Γ(W 1 , W 2 , • • • , W s ) = - s i =j < W i , W j > W i W j . (62) In addition, as a special form of angular-based measurement, a special form of inner product measurement, termed as exclusivity, has been proposed by [63] to obtain diversified models. It can jointly suppress the training error of ensemble and enhance the diversity between bases. The diversitypromoting term by exclusivity (see Eq. 37 for details) from Eq. 53 can be written as Γ(W 1 , W 2 , • • • , W s ) = - s i =j W i W j 1 (63) These measurements try to encourage the pairwise models to be uncorrelated such that each base model can provide more complement information. L 2,1 measurement. Just as the former subsection, L 2,1 norm can also be used as the diversification of multiple models [58] . the diversity-promoting regularization by L 2,1 from Eq. 53 can be formulated as Γ(W 1 , W 2 , • • • , W s ) = - s i ( K j |W i (j)|) 2 (64) The L 2,1 measurement uses the group-wise correlation between different base models and favors selecting diverse models residing in more groups. Some other diversity measurements have been proposed for deep ensemble. [85] reveals that it may be better to ensemble many instead of all of the neural networks at hand. The paper develops an approach named Genetic Algorithm based Selective Ensemble (GASEN) to obtain different weights of each neural network. Then, based on the obtained weights, the deep ensemble can be formulated. Moreover, [86] also encourages the diversity of the deep ensemble by defining a pair-wise similarity between different terms. These optimization-based methods utilize the correlation between different models and try to repulse these models from one another. The aim is to enforce these representations which are obtained from different models to be diversified and thus these base models can provide outputs reflecting multi-modal belief. 2) Sample-Based Methods In addition to diversify the ensemble learning from the optimization view, we can also diversify the models from the sample view. Generally, we randomly divide the training set into multiple subsets where each base model corresponds to a specific subset which is used as the training samples. However, there exists the overlapping between the representations of different base models. This may cause the redundancy and even decrease the performance of the ensemble learning due to the reduction of the training samples over each model by the division of the whole training set. To overcome this problem and provide more complement information from different models, [27] develops a novel method by dividing the training samples into multiple subsets by assigning the different training samples into the specified subset where the corresponding learned model shows the lowest predict error. Therefore, each base model would focus on modeling the features from specific classes. Besides, clustering is another popular method to divide the training samples for different models [87] . Although diversifying VOLUME 4, 2016 the obtained multiple subsets can make the multiple models provide more complement information, the less of training samples by dividing the whole training set will show negative effects over the performance. To overcome this problem, another way to enforce different models to be diversified is to assign each sample with a specified weight [88] . By training different base models with different weights of samples, each base model can focus on complement information from the samples. The detailed steps in [88] are as follows: • Define the weights over each training sample randomly, and train the model with the given weights; • Revise the weights over each training sample based on the final loss from the obtained model, and train the second model with the updated weights; • Train M models with the aforementioned strategies. The former methods take advantage of the labelled training samples to enforce the diversity of multiple models. There exists another method, namely Unlabeled Data to Enhance Ensemble (UDEED) [89] , which focuses on the unlabelled samples to promote diversity of the model. Unlike the existing semi-supervised ensemble methods where error-prone pseudo-labels are estimated for unlabelled data to enlarge the labelled data to improve accuracy. UDEED works by maximizing accuracies of base models on labelled data while maximizing diversity among them on unlabelled data. Besides, [90] combines the different initializations, different training sets and different feature subsets to encourage the diversity of the multiple models. The methods in this subsection process on the training sets to diversify different models. By training different models with different training samples or samples with different weights, these models would provide different information and thus the whole models could provide a larger proportional of information. 3) Ranking-Based Methods Another kind of methods to promote diversity in the obtained multiple models is ranking-based methods. All the models is first ranked according to some criterion, and then the top-L are selected to form the final ensemble. Here, [91] focuses on pruning techniques based on forward/backward selection, since they allow a direct comparison with the simple estimation of accuracy from different models. Cluster can be also used as ranking-based method to enforce diversity of the multiple models [92] . In [92] , each model is first clustered based on the similarity of their predictions, and then each cluster is then pruned to remove redundant models, and finally the remaining models in each cluster are finally combined as the base models. In addition to the former mentioned methods, [23] provides multiple diversified models by selecting different sets of multiple features. Through multi-scale or other tricks, each sample will provide large amounts of features, and then choose top-L multiple features from the all the features as the base features (see [23] for details). Then, each base feature from the samples is used to train a specific model, and the final inference can be obtained through the combination of these models. In summary, this paper summarizes the diversification methods for D-models from three aspects: optimizationbased methods, sample-based methods, and ranking-based methods. The details of the most frequently encountered diversity methods is shown in Table 3 . Optimization-based methods encourage the multiple models to be diversified by imposing diversity regularization between different base models while optimizing these models. In contrary, samplebased methods mainly obtain diversified models by training different models with specific training sets. Most of the prior works focus on diversifying the ensemble learning from the two aspects. While the ranking-based methods try to obtain the multiple diversified models by choosing the top-L models. The researchers can choose the specific method for D-models based on the special requirements of the machine learning tasks. V. INFERENCE DIVERSIFICATION The former section summarizes the methods to diversify different parameters in the model or multiple base models. The D-model focuses on the diversification of parameters in the model and improves the representational ability of the model itself while D-models tries to obtain multiple diversified base models, each of which focus on modeling different features from the samples. These works improve the performance of the machine learning process in the modeling stage (see Fig. 2 for details). In addition to these methods, there exist some other works focusing on obtaining multiple choices in the inference of the machine learning model. This section will summarize these diversifying methods in the inference stage. To introduce the methods for inference diversification in detail, we choose the graph model as the representation of the machine learning models. We consider a set of discrete random variables X = {x i |i ∈ {1, 2, • • • , N }}, each taking value y i in a finite label set L v . Let G = (V, E)(V = {1, 2, • • • , N }, E = V 2 ) describe a graph defined over these variable. The set L χ = v∈χ L v denotes a Cartesian product of sets of labels corresponding to the subset χ ∈ V of variables. Besides, denote θ A : X A → R, (∀A ∈ V ∪ E) as the functions which define the energy at each node and edge for the labelling of variables in scope. The goal of the MAP inference is to find the labelling y = {y 1 , y 2 , • • • , y N } of the variables that minimizes this real-valued energy function: y * = arg min y E(y) = arg min y A∈V ∪E θ A (y) (65) However, y * usually converges to the sub-optimal results due to the limited representational ability of the model and the limited training samples. Therefore, multiple choices, which can provide complement information, are desired from the model for the specialist. Traditional methods to obtain Machine learning model Inference Diversification Diverse Choices FIGURE 7: Effects of inference diversification for improving the performance of the machine learning model. The results come from prior work [31] . Through inference diversification, multiple diversified choices can be obtained. Then, under the help of other methods, such as re-ranking in [31] , the final solution can be obtained. multiple choices y 1 , y 2 , • • • , y M try to solve the following optimization: y m = arg min y E(y) = arg min y A∈V E θ A (y) s.t. y m = y i , i = 1, 2, • • • , m -1 (66) However, the obtained second-best choice will typically be one-pixel shifted versions of the best [28] . In other words, the next best choices will almost certainly be located on the upper slope of the peak corresponding with the most confident detection, while other peaks may be ignored entirely. To overcome this problem, many methods, such as diversified multiple choice learning (D-MCL), submodular, M-Modes, M-NMS, have been developed for inference diversification in prior works. These methods try to diversify the obtained choices (do not overlap under a user-defined criteria) while obtaining high score on the optimization term. Fig. 7 shows some results of image segmentation from [31] . Under the inference diversification, we can obtain multiple diversified choices, which represent the different optima of the data. Actually, there also exist many methods which focus on providing multiple diversified choices in the inference phase. In this work, we summarize the diversification in these works as inference diversification. The following subsections will introduce these works in detail. A. DIVERSITY-PROMOTING MULTIPLE CHOICE LEARNING (D-MCL) The D-MCL tries to find a diverse set of highly probable solutions under a discrete probabilistic model. Given a dissimilarity function measuring similarity between the pairwise choices, our formulation involves maximizing a linear combination of the probability and the dissimilarity to the previous choices. Even if the MAP solution alone is of poor TABLE 4: Overview of most frequently used inference diversification methods and the papers in which example measurements can be found. Measurements Papers D-MCL [29], [31], [93]-[96], [144] Submodular for Diversification [97]- [101] , [106] , [107] M-modes [30] M-NMS [32] , [108] - [111] , [120] DPP [5] , [151] , [154] quality, a diverse set of highly probable hypotheses might still enable accurate predictions. The goal of D-MCL is to produce a diverse set of low-energy solutions. The first method is to approach the problem with a greedy algorithm, where the next choice is defined as the lowest energy state with at least some minimum dissimilarity from the previously chosen choices. To do so, a dissimilarity function ∆(y, y i ) is defined first. In order to find the M diverse, low energy, labellings y 1 , y 2 , • • • , y M , the method proceeds by solving a sequence of problems of the form [29] , [31] , [95] , [96] , [144] y m = arg min y (E(y) -γ m-1 i=1 ∆(y, y i )) (67) for m = 1, 2, • • • , M , where γ > 0 determines a trade-off between diversity and energy, y 1 is the MAP-solution and the function ∆ : L V × L V → R defines the diversity of two labels. In other words, ∆(y, y i ) takes a large value if y and y i are diverse, and a small value otherwise. For special case, the M-Best MAP is obtained when ∆ is a 0-1 dissimilarity (i.e. ∆(y, y i ) = I(y = y i )). The method considers the pairwise dissimilarity between the obtained choices. More importantly, it is easy to understand and implement. However, under the greedy strategy, each new labelling is obtained based on the previously found solutions, and ignores the upcoming labellings [94] . Contrary to the former form, the second method formulate the M -best diverse problem in form of a single energy minimization problem [94] . Instead of the greedy sequential procedure in (67) , this method suggests to infer all M labellings jointly, by minimizing E M (y 1 , y 2 , • • • , y M ) = M i=1 E(y i )-γ∆ M (y 1 , y 2 , • • • , y M ) (68) where ∆ M defines the total diversity of any M labellings. To achieve this, let us first create M copies of the initial model. Three specific different diversity measures are introduced. The split-diversity measure is written as the sum of pairwise diversities, i.e. those penalizing pairs of labellings [94] ∆ M (y 1 , y 2 , • • • , y M ) = M i=2 i-1 j=1 ∆(y i , y j ) (69) The node-diversity measure is defined as [94] ∆ M (y 1 , y 2 , • • • , y M ) = v∈V ∆ v (y 1 v , y 2 v , • • • , y M v ) (70) Finally, the special case of the split-diversity and nodediversity measures is the node-split-diversity measure [94] ∆ M (y 1 , y 2 , • • • , y M ) = v∈V M i=2 i-1 j=1 ∆ v (y i v , y j v ) (71) The D-MCL methods try to find multiple choices with a dissimilarity function. This can help the machine learning model to provide choices with more difference and show more diversity. However, the obtained choices may not be the local extrema and there may exist other choices which could better represent the objects than the obtained ones. B. SUBMODULAR FOR DIVERSIFICATION The problem of searching for a diverse but high-quality subset of items in a ground set V of N items has been studied in information retrieval [99] , web search [98] , social networks [103] , sensor placement [104] , observation selection problem [102] , set cover problem [105] , document summarization [100] , [101] , and others. In many of these works, an effective, theoretically-grounded and practical tool for measuring the diversity of a set S ⊆ V are submodular set functions. Submodularity is a property that comes from marginal gains. A set function F : 2 V → R is submodular when its marginal gains F (a|S) ≡ F (S ∪ a) -F (S) are decreasing: F (a|S) ≥ F (a|T ) for all S ⊆ T and a / ∈ T . In addition, if F is monotone, i.e. F (S) ≤ F (T ) whenever S ⊆ T , then a simple greedy algorithm that iteratively picks the element with the largest marginal gain F (a|S) to add to the current set S, achieves the best possible approximation bound of (1 - 1 e ) [107] . This result has presented significant practical impact. Unfortunately, if the number N = |V | of items is exponentially large, then even a single linear scan for greedy augmentation is simply infeasible. The diversity is measured by a monotone, nondecreasing and normalized submodular function f : 2 V → R + . Denote S as the set of choices. The diversification is measured by a monotone, nondecreasing and normalized submodular function D : 2 V → R + . Then, the problem can be transformed to find a maximizing configurations for the combined score [97] - [101] F (S) = E(S) + γD(S) (72) The optimization can be solved by the greedy algorithm that starts out with S 0 = ∅, and iteratively adds the best term: y m = arg max y F (y|S m-1 ) = arg max y {E(y) + γD(y|S m-1 )} (73) where S m = y m S m-1 . The selected choice S m is within a factor of 1 -1 e of the optimal solution S * : F (S m ) ≥ (1 - 1 e )F (S * ). (74) The submodular takes advantage of the maximization of marginal gains to find multiple choices which can provide the maximum of complement information. C. M-NMS Another way to obtain multiple diversified choices is the nonmaximum suppression (M-NMS) [111] , [150] . The M-NMS is typically defined in an algorithmic way: starting from the MAP prediction one goes through all labellings according to an increasing order of the energy. A labelling becomes part of the predicted set if and only if it is more than ρ away from the ones chosen before, where ρ is the threshold defined by user to judge whether two labellings are similar. The M-NMS guarantee the choices to be apart from each other. The M-NMS is typically implemented by greedy algorithm [32] , [110] , [111] , [120] . A simple greedy algorithm for instantiating multiple choices are used: Search over the exponentially large space of choices for the maximally scoring choice, instantiate it, remove all choices with overlapping, and repeat. The process is repeated until the score for the next-best choice is below a threshold or M choices have been instantiated. However, the general implementation of such an algorithm would take exponential time. The M-NMS method tries to find M-best choices by throwing away the similar choices from the candidate set. To be concluded, the D-MCL, submodular, and M-NMS have the similar idea. All of them tries to find the M-best choices under a dissimilarity function or the ones which can provide the most complement information. D. M-MODES Even though the former three methods guarantee the obtained multiple choices to be apart from each other, the choices are typically not local extrema of the probability distribution. To further guarantee both the local extrema and the diversification of the obtained multiple choices simultaneously, the problem can be transformed to the M-modes. The Mmodes have multiple possible applications, because they are intrinsically diverse. For a non-negative integer δ, define the δ-neighborhood of a labelling y to be N δ = {y|d(y, y ) ≤ δ} as the set of labellings whose distances from y is no more than δ, where d(•) measures the distance between two labellings, such as the Hamming distance. Then, a labelling y is defined as a local maximum of the energy function E(•), iff E(y) ≥ E(y ), ∀y ∈ N (y). Given δ, the set of modes is denoted by M δ , formally, [30] M δ = {y|E(y ) ≥ E(y), ∀y ∈ N δ (y)} (75) As δ increases from zero to infinity, the δ-neighborhood of y monotonically grows and the set of modes M δ monotonically decreases. Therefore, the M δ can form a nested sequence, [30] M 0 ⊇ M 1 ⊇ • • • ⊇ M ∞ = {MAP} (76) Here, the M-modes can be defined as computing the M labellings with minimal energies in M δ . Then, the problem has been transformed to M-modes: Compute the M labellings with minimal energies in M δ . Besides, [30] has already validated that a labelling is a mode if and only if it behaves like a \"local mode\" everywhere, and thus a new chain has been constructed and Mmodes problem is reduced into the M best problem of the new chain. Furthermore, it also validates the one-to-one cost preserving correspondence between consistent configurations α and the set of modes M δ . Therefore, the problem of computing the M best modes are transferred to the problem of computing the M best configurations in the new chain. Different from the former three methods, M-modes can obtain M choices which are the local extrema of the optimization and this can provide M choices which contains the most complement information. E. DPP General M-NMS and M-Modes try to select choices with the highest scores. Since these methods give a priority to scores of the choices, it might finally end up in selecting the overlapping choices and miss the best possible set of nonoverlapping ones with acceptable scores [5] , [151] , [154] . To address this problem, [5] , [151] , [154] attempt to use the DPP to select a set of diverse and informative choices with enriched representations. The definition of DPP have been introduced in detail in subsection III-A. It can be noted that the DPP is a distribution over the subsets of a fixed ground set, which prefers a diverse set of points. The selected subset of items by DPP can be representative and cover significant amount of information from the whole set. Besides, the selection would be diverse and non-repetitive [5] , [154] . To make the inference diversification, [5] calculates the probability of inclusion of each choice depends on the determinant of a kernel matrix. The kernel matrix is defined such that it captures all spatial and contextual information between choices all at once. To apply the DPP, the quality and diversity terms need to be defined. The quality term (unary score) defines the optimization term, such as the E(y) in Eq. 66. The diversity term defines the pairwise correlation of the obtained choices. Similar to Eq. 68, the model is first transformed into the Mbest diverse problem in form of a single energy minimization problem. The optimization problem based on the DPP can be formulated as E M (y 1 , y 2 , • • • , y M ) = M i=1 E(y i )-γ det(L(y 1 , y 2 , • • • , y M )) (77) The kernel matrix in DPP is defined as L(y 1 , y 2 , • • • , y M ) = [L ij ] i,j=1,2,••• ,M (78) where L ij = E(y i )E(y j )S ij . S ij is the similarity term to computer the dissimilarity between different choices. A DPP tends to pick uncorrelated choices in these cases. On the other hand, higher quality items increase the determinant, and thus a DPP tends to pick high-quality and diverse set of choices. F. ANALYSIS Even though all the methods in former subsections can be used for inference diversity, there exists some difference between these methods. These methods in prior works are summarized in Table 4 . It can be noted from the former subsections that the D-MCL is the easiest one to implement. One only needs to calculate the MAP choice and obtain other choices by constraining the optimization with a dissimilarity function. In contrary, the M-NMS neglects the choices which are in the neighbors of the former choice and obtain other choices from the remainder. The D-MCL and M-NMS obtain choices by solving the optimization with the user-defined similarity while the submodular method tries to obtain the choices which can provide the maximal marginal and complement information. The former three methods may provide choices which is not local optima while the local optimal choices usually contain more information than others. Therefore, different from the former three methods, the Mmodes tries to obtain multiple diversified choices which are also local optima. All these methods before can be used in traditional machine learning methods. The DPP method for inference diversification which is developed by [5] , [151] is mainly applied in object detection tasks. The methods in [5] , [151] take advantage of the merits of DPP to obtain high quality choices with less overlapping which could present better performance than M-NMS and M-modes. From the introduction of data diversification, D-model, D-models, and inference diversification, one can choose the proper method for diversification of machine learning in various computer vision tasks. In the following, we'll introduce some applications of diversity technology in machine learning model. VI. APPLICATIONS Diversity technology in machine learning can significantly improve the representational ability of the model in many computer vision tasks, including the remote sensing imaging tasks [20] , [22] , [77] , [112] , camera relocalization [87] , [88] , natural image segmentation [29] , [31] , [95] , object detection [32] , [109] , machine translation [96] , [113] , information retrieval [99] , [114] , [158] - [160] , social network analysis [99] , [155] , [157] , document summarization [100] , [101] , [162] , web search [11] , [98] , [156] , [164] , and others. The diversity priors, which can decrease the redundancy in the learned model or diversify the obtained multiple choices, can provide more informative features and show powerful ability in real-world application, especially for the machine learning tasks with limited training samples and complex structures in the training samples. In the following, we'll introduce some of the applications of the diversity technology in machine learning. A. REMOTE SENSING IMAGING TASKS Remote sensing images, such as the hyperspectral images and the multi-spectral images, have played a more and more important role in the past two decades [115] . However, there exist some typical difficulties in remote sensing imaging tasks. First, limited number of training samples in remote sensing imaging tasks usually make it difficult to describe the images. Since labelling is usually time-consuming and cost, it usually cannot provide enough training samples to train the model. Besides, remote sensing images usually have large intra-class variance and low inter-class variance, which make it difficult to extract discriminative features from the images. Therefore, proper feature extraction models are required for the representations of the remote sensing images. Recently, deep models have demonstrated their impressive performance in extracting features from the remote sensing images [152] . However, the deep models usually consist of large amounts of parameters while the limited training samples would make the learned deep model be sub-optimal. This would limit the performance of the deep models for the representation of the remote sensing images. To overcome these problems, some works have applied the diversity-promoting prior to diversify the model for better performance [20] , [22] , [62] , [153] . [22] and [20] attempt to diversify the learned model with the independence prior, which is based on the cosine similarity in the former section for remote sensing images. [22] develops a special diversitypromoting deep structural metric learning method for scene classification in remote sensing while [20] imposes the independence prior on deep belief network (DBN) for hyperspectral image classification. If we denote W = [w 1 , w 2 , • • • , w s ] as the metric parameter factors in [22] and the latent factors of RBM in [20] , then the diversity term by the independence prior in the two papers can be formulated as f (W ) = K i =j < w i , w j > w i w j ( 79 ) where K is the number of the factors. The diversity term f (W ) encourages the factors to be diversified, so as to improve the representational ability of the model for the images. As introduced in subsection IV-A3, to make use of the multiple information, [62] have applied the DPP prior in the learning process of deep model for hyperspectral image classification. The DPP prior can be formulated as P (W ) = (det(ψ(W ))) γ (80) The diversity regularization f (W ) in Eq. 21 can be written as f (W ) = -log[(det(ψ(W )))] (81) Besides, [62] also provides the way to process the diversity regularization by the back propagation, ∂f (W ) ∂W = - ∂ log det(ψ(W )) ∂W = -2W (W W T ) -1 . ( 82 ) With the developed diversified model for hyperspectral image representation, the classification performance can be significantly improved [62] . These prior works mainly improve the representational ability of the model for better performance from the D-model view. Besides, [38] , [153] tries to improve the representational ability from the data diversification way. [38] , [153] create the pseudo classes with the center points. In [153] , the pseudo classes are used to decrease the intra-class variance. Furthermore, the diversity-promoting prior, which is created based on the Euclidean distance to repulse different pseudo classes from each other, is used to improve the effectiveness of the developed training process for remote sensing scenes. In [38] , the pseudo classes are used for unsupervised learning of remote sensing scene representation. The pseudo classes are used to allocate pseudo labels and training the model under the supervised way. Similar to [153] , the diversity-promoting prior is also used to repulse different pseudo classes from each other to improve the effectiveness of the unsupervised learning process. Furthermore, some other works focus on the diversification of multiple models for remote sensing images [77] , [112] . [77] has applied cross entropy measurement to diversify the obtained multiple models and then the obtained multiple models could provide more complement information (See subsection IV-B1 for details). Different from [77] , [112] divides the training samples into several subsets for different models, separately. Then, each model focuses on the representation of different classes and the whole representation of these models could be improved (See subsection IV-B2 for details). To further describe the effectiveness of the diversitypromoting methods in machine learning, we listed some comparison results between the general model and the diversified model over different datasets in Table 5 . The results come from the prior works. This work choose the Ucmerced Land use dataset, Pavia University dataset, and the Indian Pines as representatives. Ucmerced Land Use dataset [79] was manually extracted from orthoimagery. It is multi-class land-use scenes in the visible spectrum which contains 2100 aerial scene images divided into 21 challenging scene categories, including agricultural, airplane, baseball diamond, beach, buildings, chaparral, dense residential, forest, freeway, golf course, harbor, intersection, medium density residential, mobile home park, overpass, parking lot, river, runway, sparse residential, storage tanks, and tennis court. Each scene has 256 × 256 pixels with a resolution of one foot per pixel. For the experiments in Table 5 , 80% scenes of each class are used for training and the remainder are for testing. 20 VOLUME 4, 2016 From the comparisons in Table 5 , we can find that the diversity technology can improve the representational ability of the machine learning model and thus significantly improve the classification performance of the learned machine learning model. B. IMAGE SEGMENTATION In computer vision, image segmentation is the process of partitioning a digital image into multiple segments (sets of pixels). The goal of segmentation is to simplify and change the representation of an image into something that is more meaningful and easier to analyze. More precisely, image segmentation is the process of assigning a label to each pixel in an image such that pixels with the same label share certain characteristics. Since a semantic segmentation algorithm deals with tremendous amount of uncertainty from inter and intra object occlusion and varying appearance, lighting and pose, obtaining multiple best choices from all possible segmentations tends to be one of the possible way to solve the problem. Therefore, the image segmentation problem can be transformed into the M-best problem. However, as traditional problem in M-best problem, the obtained multiple choices are usually similar and the information provided to the user tends to be redundant. As section V shows, the obtained multiple choices will usually be only one-pixel shifted versions to each other. The way to solve this problem is to introduce diversity into the training process to encourage the multiple choices to be diverse. Under inference diversification, the model is desired to provide a diverse set of low-energy solutions which represent different local optimal results from the data. Fig. 7 shows the examples of inference diversification over the task in prior work [31] . Many works [29] , [31] , [93] - [95] , [97] , [117] - [119] have introduced inference diversity into the image segmentation tasks via different ways. [29] first introduces the D-MCL in subsection V-A for image segmentation. The work developed the diversification method as Eq. 67 shows. To further improve the performance in work [29] , prior works [31] and [93] combine the D-MCL with reranking which provide a way to obtain multiple diversified choices and select the proper one from the multiple choices. As discussed in subsection V-A, the greedy nature of original D-MCL makes the obtained labelling only be influenced by previously found labellings while ignore the upcoming labellings. To overcome this problem, [94] develops a novel D-MCL which has the form as Eq. 68. Besides, [97] , [119] use the submodular to measure the diversification between multiple choices (see details in subsection V-B). [118] combines the NMS (see details in subsection V-C) and the sliding window to obtain multiple choices. Instead of inference diversification for better performance of image segmentation, prior work [27] tries to obtain multiple diversified models for image segmentation task. The method proposed by [27] is to divide the training samples into several subsets where each base model is trained with a specific one. Through allocating each training sample to the model with lowest predict error, each model tends to model different classes from others. Under the inference diversification and D-models for image segmentation tasks, the obtained multiple choices would be diversified as Fig. 7 shows and the performance of the model would also be significantly improved. Just as the remote sensing imaging tasks, we list some comparison results in prior works to show the effectiveness of the diversity technology in machine learning. The comparison results are listed in Table 6 . Generally, the experimental results on the PASCAL Visual Object Classes Challenge (PASCAL VOC) dataset are chosen to show the effectiveness of the diversity in machine learning for image segmentation. Also, From the table 6, we can find that the inference diversification can significantly improve the performance for segmentation. VOLUME 4, 2016 C. CAMERA RELOCALIZATION Camera relocalization is to estimate the pose of a camera relative to a known 3D scene from a single RGB-D frame [87] . It can be formulated as the inversion of the generative rendering procedure, which is to find the camera pose corresponding to a rendering of the 3D scene model that is most similar to the observed input. Since the problem is a nonconvex optimization problem which has many local optima, one of the methods to solve the problem is to find a set of M predictors which generate M camera pose hypotheses and then infers the best pose from the multiple pose hypotheses. Similar to traditional M-best problems, the obtained M predictors is usually similar. To overcome this problem and obtain hypotheses that are different from each other, [88] tries to learn 'marginally relevant' predictors, which can make complementary predictions, and compare their performance when used with different selection procedures. In [88] , greedy algorithm is used to obtain multiple diversified models. Different weights are defined on each training samples, and the weights is updated with the training loss from the former learned model. Finally, multiple diversified models can be obtained for camera relocalization. D. OBJECT DETECTION Object detection is one of the computer vision tasks which deals with detecting instances of semantic objects of a certain class (such as humans, buildings, or cars) in digital images and videos. Similar to image segmentation tasks, great uncertainty is contained in the object detection algorithms. Therefore, obtaining multiple diversified choices is also an important way to solve the problem. Some prior works [32] , [109] have made great effects to obtain multiple diversified choices by M-NMS (see V-C for details). [32] use the greedy procedure for eliminating repeated detections via NMS. Besides, [109] demonstrates that the energies resulting from M-NMS lead to the maximization of submodular function, and then through branch-and-bound strategy [126] , all the image can be explored and diversified multiple detections can be obtained. E. MACHINE TRANSLATION Machine translation (MT) task is a sub-field of computational linguistics that investigates the use of software to translate text or speech from one language to another. Recently, machine translation systems have been developed and widely used in real-world application. Commercial machine translation services, such as Google translator, Microsoft translator, and Baidu translator, have made great success. From the perspective of the user interaction, the ideal machine translator is an agent that reads documents in one language and provides accurate, high quality translations in another. This interaction ideal has been implicit in machine translation (MT) research since the field's inception. Unfortunately, when a real, imperfect MT system makes an error, the user is left trying to guess what the original sentence means. Therefore, to overcome this problem, providing the M-best translations instead of a single best one is necessary [116] . However, in MT, for example, many translations on M-best lists are extremely similar, often differing only by a single punctuation mark or minor morphological variation. The implicit goal behind these technologies is to better explore the output space by introducing diversity into the surrogate set. Some prior works have introduced diversity into the obtained multiple choices and obtained better performance [113] . [96] develops the method to diversify multiple choices which is introduced in subsection V-A. In the works, a novel dissimilarity function has been defined on different translations to increase the diversity between the obtained translations. It can be formulated as [96] ∆ n (y, y ) = - |y|-q i=1 |y |-q j=1 [[y i:i+q = y j:j+q ]] (83) where [[•]] is the Iverson bracket (1 if input condition is true, 0 otherwise) and y i:j is the subsequence of y from word i to word j (inclusive). The advantage of this dissimilarity function is its simplicity. Besides, the diversity-promoting can ensure the machine learning system obtain multiple diversified translation for the user. F. INFORMATION RETRIEVAL 1) Natural Language Processing In machine learning and natural language processing, a topic model is a statistical model for discovering the abstract \"topics\" that occur in a collection of documents. Probabilistic topic models such as Latent Dirichlet Allocation (LDA) and Restricted Boltzmann Machine (RBM) can provide a useful and elegant tool for discovering hidden structure within large data sets of discrete data, such as corpuses of text. However, LDA implicitly discovers topics along only a single dimension while RBM tends to learn multiple redundant hidden units to best represent dominant topics and ignore those in the long-tail region [21] . To overcome this problem, diversifying over the learned model (D-model) can be applied over the learning process of the model. Recent research on multi-dimensional topic modeling aims to devise techniques that can discover multiple groups of topics, where each group models some different dimension or aspect of the data. Therefore, prior work [114] presents a new multi-dimensional topic model that uses a determinantal point process prior (see details in subsection V-A) to encourage different groups of topics to model different dimensions of the data. Determinantal point processes are probabilistic models of repulsive phenomena which originated in statistical physics but have recently seen interest from the machine learning community. Besides, [21] introduces the RBM for topic modeling to utilize hidden units to discover the latent topics and learn compact semantic representations for documents. Furthermore, to reduce the redundancy of the learned RBM, [21] utilizes the angular-based diversification method which has the form of Eq. 31 to diversify the learned hidden units in RBM. Under the diversification, the RBM can learn much more powerful latent document representations that boost the performance of topic modeling greatly [21] . 2) Web Search The problem of result diversification has been studied in various tasks, but the most robust literature on result diversification exists in web search [164] . Web search has become the prodominant method for people to fulfill their information needs. In web search, it is general to provide different search results with different interpretations of a query. To satisfy the requirement of multiple distinct user type, the web search system is desired to provide a diverse set of results. The increasing requirements for easily accessible information via web-based services have attracted a lot of attentions on the studies of obtaining diverse search results [11] , [98] , [156] , [164] . The objective is to achieve large coverage on a few features but very small coverage on the remaining features, which satisfies the submodularity. Therefore, [98] , [164] take advantage of the submodular for result diversification (see Subsection V-B for details). Besides, [156] uses the distance-based measurement to formulate the dissimilarity function in Subsection V-A and [11] has further summarized the diversification methods for result diversification which has the form as D-MCL (See Subsection V-A for details). These search diversification methods can provide multiple diversified choices for the users to satisfy the requirements of specific information. G. SOCIAL NETWORK ANALYSIS Social network analysis is a process of investigating social structures through the use of networks and graph theory. It characterizes networked structures in terms of nodes and the ties, edges, or links (relationships or interactions) that connect them. Ranking nodes on graphs is a fundamental task in social network analysis and it can be applied to measure the centrality in social networks [99] . However, many nodes in top-K ranking list obtained general methods are general similar since it only takes the relevance of the nodes into consideration [155] . To improve the effectiveness of the ranking process, many prior works have incorporated the diversity into the top-K ranking results [99] , [155] , [157] . To enforce diversity in the top-K ranking results, the way to measure the similarity tends to be the key problem. [99] has formulated the diversified ranking problem as a submodular set function maximization and processes the problem as Subsection V-B shows. Besides, [155] takes advantage of the Heat kernel to formulate the weights on the social graph (see Subsection IV-A3 for details) where larger weights would be if points are closer. Then through the random walks in an absorbing Markov chain, diversified ranking can be obtained [155] . Furthermore, according to the special characteristics, [157] develops a novel goodness measure to balance both the relevant and the diversity. For simplicity, the goodness measure would not be shown in this work and more details can be found in [157] for interested readers. It should be noted that the optimization problem in [157] is equal to the D-MCL in subsection V-A. H. DOCUMENT SUMMARIZATION Multi-document summarization is an automatic procedure aimed at extraction of information from multiple texts written about the same topic. Generally, a good summary should coverage elements from distinct parts of data to be representative of the corpus and does not contain elements that are too similar to each other. Therefore, coverage and diversity are usually essential for the multi-document summarization [161] . Since coverage and diversity could sometimes be conflicting requirements [161] , some prior works try to find a tradeoff between the coverage and the diversity. As Subsection V-B shows, since there exist efficient algorithms (with near-optimal solutions) for a diverse set of constraints when the submodular function is monotone in the document summarization task, the submodular optimization methods have been applied in the diversification of the obtained summary of the multiple documents [100] , [101] , [161] - [163] . [100] defines a class of submodular functions meant for document summarization and [101] treats the document summarization problem as maximizing a submodular function with a budget constraint. [161] further investigates the personalized data summarization by the submodular function subject to multiple constraints. Under the diversification by submodular, the obtained elements can be diversified and the multiple documents can be better summarized. VII. DISCUSSIONS This article surveyed the available works on diversity technology in general machine learning model, by systematically categorizing the diversity in training samples, D-model, Dmodels, and inference diversity in the model. We first summarize the main results and identify the challenges encountered throughout the article. Recently, due to the excellent performance of the machine learning model for feature extraction, machine learning methods have been widely applied in real-world applications. However, the limited number and imbalance of training samples in real-world applications usually make the learned machine learning models be sub-optimal, sometimes even lead to the \"over-fitting\" in the training process. This would limit the performance of the machine learning models. Therefore, this work summarizes the diversity technology in prior works which can work on the machine learning model as one of the methods to improve the model's representational ability. We want to emphasize that the diversity technology is not decisive. The diversity can only be considered as an additional technology to improve the performance of the machine learning process. Through the introduction of the diversity in machine learning, the three questions proposed in the introduction can be easily answered. The detailed descriptions of data diversification, model diversification, and inference diversification are introduced in sections III, IV, and V. With these methods, the machine learning model can be diversified and the performance can be improved. Besides, the diversification of the model (D-model) tries to improve the representational ability of the machine learning model directly (see Fig. 5 for details) while the diversification of the models (D-models) aims to obtain multiple diversified choices under the diversification of the ensemble learning (see Fig. 6 for details). It should also be noted that the diversification measurements for data diversification, model diversification, and the inference diversification show some similarity. As introduced, the diversity aims to decrease the redundancy between the data or the factors. The key problem for diversification is the way to measure the similarity between the data or the factors. However, in the machine learning process, the data and the factors are processes as the vectors. Therefore, there exist overlaps between the data diversification, model diversification as well as the inference diversification, such as the DPP measurement. More importantly, we should also note that the diversification in different steps of machine learning models presents its special characteristics. The details for the applications of diversity methods are shown in section VI. This work only lists the most common applications in real-world. The readers should consider whether the diversity methods are necessary according to the specific task they face with. Advice for implementation. We expect this article is useful to researchers who want to improve the representational ability of machine learning models for computer vision tasks. For a given computer vision task, the proper machine learning model should be chosen first. Then, we advise to consider adding diversity-promoting priors to improve the performance of the model and further what type of diversity measurement is desired. When one desires obtain multiple models or multiple choices, then one can consider diversifying multiple models or the obtained multiple choices and section IV-B and V would be relevant and helpful. We advise the reader to first consider whether the multiple models or multiple choices can be helpful for the performance. VIII. CONCLUSIONS The training of machine learning models requires large amounts of labelled samples. However, the limited training samples constrain the performance of machine learning models. Therefore, effective diversity technology, which can encourage the model to be diversified and improve the representational ability of the model, is expected to be an active area of research in machine learning tasks. This paper summarizes the diversity technology for machine learning in previous works. We introduce diversity technology in data pre-processing, model training, inference, respectively. Other researchers can judge whether diversity technology is needed and choose the proper diversity method for the special requirements according to the introductions in former sections. FIGURE 1 : 1 FIGURE 1: The basic framework of this paper. The main body of this paper consists of three parts: General Machine Learning Models in Section II, Diversity in Machine Learning in Section III-V, and Extensive Applications in Section VI. FIGURE 3 : 3 FIGURE 3: Flowchart of a special form of supervised machine learning with single model. Since diversity mainly occurs in the training batch in the data-preprocessing, this work will mainly discuss the diversity of samples in the training batch for data diversification. Generally, the more diversification and balance each training batch is, the more effectiveness the training process is. In addition, it should be noted that the factors in the same layer of the model can be diversified to improve the representational ability of the model (which is called D-model in this paper). Moreover, when we obtain multiple choices from the model, the obtained choices are desired to provide more complement information. Therefore, some works focus on the diversification of multiple choices (which we call inference diversification). FIGURE 5 : 5 FIGURE 5: Effects of D-model on improving the performance of the machine learning model. Under the model diversification, each parameter factor of the machine learning model tends to model unique information and the whole machine learning model can model more useful information from the objects. Thus, the representational ability can be improved. The figure shows the results from the image segmentation task in [31]. As showed in the figure, the extracted features from the model can better discriminate different objects. FIGURE 6 : 6 FIGURE 6: Effects of D-models for improving the performance of the machine learning model. The figure shows the image segmentation task from the prior work [27]. The single model often produce solutions with low expected loss and step into the sub-optimal results. Besides, general ensemble learning usually provide multiple choices with great similarity. Therefore, this work summarizes the methods which can diversify the ensemble learning (D-models). As the figure shows, under the model diversification, each model of the ensemble can produce different outputs reflecting multi-modal belief [27]. TABLE 2 : 2 Comparisons of Different Measurements.represents that the measurement possess the property while × means the measurement does not possess the property. Measurements Pairwise Correlation Multiple Correlation Group-wise Correlation Scale Invariant Cosine Similarity × × Determinantal Point Process × Submodular Spectral Diversity × Euclidean Distance × × × Heat Kernel × × × Divergence × × Uncorrelation and Evenness × L 2,1 × × × Inner Product × × × D-models Inference Horse Cow Inference Inference TABLE 3 : 3 Overview of most frequently used diversification method in D-models and the papers in which example measurements can be found. Methods Measurements Papers Divergence [26], [69] Optimization-based Renyi-entropy Cross Entropy [76] [77], [78] Cosine Similarity [63], [66] L 2,1 [58] NCL [73], [74] , [82] , [83] Others [64]-[66], [69]-[72] Sample-based -[27], [87]-[90] Ranking-based -[ 23 ], [91] , [92] TABLE 5 : 5 Some comparison results between the general model and the diversified model for remote sensing imaging tasks.) over the city of Pavia, Italy. The image consists of 610 × 340 pixels with 115 spectral bands. The image is divided into 9 classes with a total of 42, 776 labelled samples, including the asphalt, meadows, gravel, trees, metal sheet, bare soil, bitumen, brick, and shadow. For the experiments, 200 samples of each class are used for training and the remainder are for testing. Indian Pines dataset [81] was taken by AVIRIS sensor in northwestern Indiana. The image has 145 × 145 pixels with 224 spectral channels where 24 channels are removed due to the noise. The image is divided into 8 classes with a total of 8, 598 labelled samples, including the Corn no_till, Corn min_till, Grass pasture, hay windrowed, Soybeans no_till, Soy beans min, Soybeans clean, and woods. For the experiments, 200 samples of each class are used for training and the remainder are for testing. Dataset Reference Methods Accuracy (%) Diversified Method Accuracy (%) Ucmerced Land Use dataset [22] [77] DSML CaffeNet 95.95 ± 0.24 95.48 D-DSML Diversified MCL 96.76 ± 0.36 97.05 ± 0.55 [20] DBN 91.18 ± 0.08 D-DBN-PF 93.11 ± 0.06 Pavia University [62] DML-MS-CNN 99.03 ± 0.25 DPP-DML-MS-CNN 99.46 ± 0.03 [112] DBN 90.61 ± 1.15 M-DBN 92.55 ± 0.74 Indian Pines [20] [62] DBN DML-MS-CNN 98.87 ± 0.21 DPP-DML-MS-CNN 88.25 ± 0.17 D-DBN 91.03 ± 0.12 99.08 ± 0.23 Pavia University dataset [80] was gathered by a sensor known as the reflective optics system imaging spectrometer (ROSIS-3 TABLE 6 : 6 Some comparison results between the general model and the diversified model for image segmentation. Dataset Reference Methods Accuracy (%) Diversified Method Accuracy (%) PASCAL VOC 2010 dataset [29] MAP 91.54 DivMBEST 95.16 PASCAL VOC 2011 dataset [27] MCL about 66 sMCL about 71 PASCAL VOC 2012 dataset [31] Second Order Pooling (O 2 P )-MAP 46.5 DivMBEST+Ranking 48.1 PASCAL VOC 2012 dataset [97] MAP 43.43 submodular-MCL 55.32 VOLUME 4, 2016 VOLUME 4, 2016 VOLUME 4, 2016 VOLUME 4, 2016 VOLUME 4, 2016 VOLUME 4, 2016 VOLUME 4, 2016 VOLUME 4, 2016 VOLUME 4, 2016 VOLUME 4, 2016"
}