{
  "title": "Machine learning for accuracy in density functional approximations",
  "abstract": "Machine learning techniques have found their way into computational chemistry as indispensable tools to accelerate atomistic simulations and materials design. In addition, machine learning approaches hold the potential to boost the predictive power of computationally efficient electronic structure methods, such as density functional theory, to chemical accuracy and to correct for fundamental errors in density functional approaches. Here, recent progress in applying machine learning to improve the accuracy of density functional and related approximations is reviewed. Promises and challenges in devising machine learning models transferable between different chemistries and materials classes are discussed with the help of examples applying promising models to systems far outside their training sets.",
  "introduction": "INTRODUCTION Machine learning (ML) techniques play an increasingly important role in atomistic-scale simulations in computational chemistry and physics. [1] [2] [3] Major areas of research are the acceleration of materials discovery and extending computationally accessible time and length scales through accelerated simulations. Inter-atomic potentials represented by neural networks [4] [5] [6] [7] or other ML regression techniques 8, 9 enable accurate molecular dynamics simulations for system sizes and time scales well beyond what can be achieved with first-principles Hamiltonians. 10 When computation of the Born-Oppenheimer potential energy surface is not required, ML approaches trained to map chemical composition and other not necessarily atomic structure sensitive features to system properties of interest are powerful methods for direct, approximate materials property predictions. [11] [12] [13] [14] [15] Such methods can furthermore be employed for inverse materials design, where molecules or materials compositions that could lead to a desired target metric are predicted. 16, 17 These models and inter-atomic potentials are trained on high-throughput datasets generated with computationally affordable methods. Density functional theory (DFT) 18 is often the method of choice due to a favorable trade-off between computational complexity and accuracy for the prediction of the electronic structures of molecules and solids. 19, 20 Some (minor or appreciable) loss in accuracy with respect to the DFT training data is typically tolerated with the advantage of significant speed up of the resulting ML methods over DFT simulations. At best, these ML methods can reproduce the quality of the DFT training data. ML approaches are, however, also employed to increase the accuracy of DFT and related methods rather than substituting these first-principles approaches completely with ML models for acceleration. The ML methods are trained against chemically accurate quantum chemistry reference data or experimental benchmark data, where sufficient accuracy with beyond-DFT methods currently cannot be achieved. These methods can be categorized (Figure 1 ) into machine-learned density functionals for exchange and correlation (XC), atomic structure-dependent, machine-learned Hamiltonian corrections, and ∆-ML approaches that learn a correction to be applied to DFT results (as post-DFT corrections), with some methods belonging to more than one of these categories. Here, recent progress in ML approaches to increasing accuracy and to correcting fundamental errors in density functional approximations (DFA) is reviewed. These approaches hold the promise of providing DFT predictions with chemical accuracy and enabling accurate electronic structure simulations where DFAs fundamentally fail and which are currently out of reach for higher levels of theory. There are, however, challenges in availability of accurate training data for these latter systems and there can be issues with transferability of the ML methods beyond their training data. Examples are provided demonstrating such transferability issues for promising ML models.",
  "body": "INTRODUCTION Machine learning (ML) techniques play an increasingly important role in atomistic-scale simulations in computational chemistry and physics. [1] [2] [3] Major areas of research are the acceleration of materials discovery and extending computationally accessible time and length scales through accelerated simulations. Inter-atomic potentials represented by neural networks [4] [5] [6] [7] or other ML regression techniques 8, 9 enable accurate molecular dynamics simulations for system sizes and time scales well beyond what can be achieved with first-principles Hamiltonians. 10 When computation of the Born-Oppenheimer potential energy surface is not required, ML approaches trained to map chemical composition and other not necessarily atomic structure sensitive features to system properties of interest are powerful methods for direct, approximate materials property predictions. [11] [12] [13] [14] [15] Such methods can furthermore be employed for inverse materials design, where molecules or materials compositions that could lead to a desired target metric are predicted. 16, 17 These models and inter-atomic potentials are trained on high-throughput datasets generated with computationally affordable methods. Density functional theory (DFT) 18 is often the method of choice due to a favorable trade-off between computational complexity and accuracy for the prediction of the electronic structures of molecules and solids. 19, 20 Some (minor or appreciable) loss in accuracy with respect to the DFT training data is typically tolerated with the advantage of significant speed up of the resulting ML methods over DFT simulations. At best, these ML methods can reproduce the quality of the DFT training data. ML approaches are, however, also employed to increase the accuracy of DFT and related methods rather than substituting these first-principles approaches completely with ML models for acceleration. The ML methods are trained against chemically accurate quantum chemistry reference data or experimental benchmark data, where sufficient accuracy with beyond-DFT methods currently cannot be achieved. These methods can be categorized (Figure 1 ) into machine-learned density functionals for exchange and correlation (XC), atomic structure-dependent, machine-learned Hamiltonian corrections, and ∆-ML approaches that learn a correction to be applied to DFT results (as post-DFT corrections), with some methods belonging to more than one of these categories. Here, recent progress in ML approaches to increasing accuracy and to correcting fundamental errors in density functional approximations (DFA) is reviewed. These approaches hold the promise of providing DFT predictions with chemical accuracy and enabling accurate electronic structure simulations where DFAs fundamentally fail and which are currently out of reach for higher levels of theory. There are, however, challenges in availability of accurate training data for these latter systems and there can be issues with transferability of the ML methods beyond their training data. Examples are provided demonstrating such transferability issues for promising ML models. SHORTCOMINGS OF DENSITY FUNCTIONAL APPROXIMA-TIONS DFT drastically reduces the complexity of the electronic structure problem by expressing the total energy E total of a system as a functional of the electronic charge density ρ rather than the many-electron wave function. In the Kohn-Sham (KS) formulation of DFT, this density functional is E total [ρ] = T KS [ρ] + E XC [ρ] + E H [ρ] + E ext [ρ]. (1) T KS [ρ] is the kinetic energy of an auxiliary system of non-interacting particles with the same density ρ as the true system of interacting electrons. Functional differentiation δE total /δρ leads to a set of single-particle like KS equations with an effective one-body KS potential, from which T KS [ρ] is computed. E ext [ρ] accounts for the interaction with an external potential (given, e.g., by interaction with nuclei) and E H [ρ] for the electrostatic interaction of the density with itself. The XC functional E XC [ρ] accounts for the two-body Coulomb interaction of the electrons and corrects for self-interaction in E H [ρ] and differences between T KS [ρ] and the kinetic energy of interacting electrons. In principle, Eq. 1 is exact, was E XC [ρ] known. In practice, E XC [ρ] must be approximated. A few of the issues of approximations to E XC [ρ], some of which could be improved upon using ML methods, are summarized below. For a review of the limitations of DFAs, the reader is referred to Refs. [21-25]. The exact (unknown) E XC [ρ] is a universal functional not depending on the system in consideration. Approximations to it typically perform better for prediction of some materials properties at the cost of a worse prediction of others. Generalized gradient approximations (GGA), in which E XC [ρ] is expressed locally as a functional of the density and its gradient, improve upon the simplest approximation only depending on the local density (local density approximation: LDA; local spin density approximation: LSDA), which is fitted accurately 26, 27 against Quantum Monte Carlo (QMC) simulations of the homogeneous electron liquid. 28 Some GGAs perform relatively well for solid structural and elastic properties but not for reaction energetics and vice versa. [29] [30] [31] [32] Meta-GGAs, that additionally dependent on the Kohn-Sham kinetic energy density τ or the Laplacian of ρ improve the range of applicability over GGA approaches. [33] [34] [35] [36] [37] [38] The spurious electrostatic interaction of an electron with itself contained in the Hartree term E H is difficult to compensate with the above semi-local functionals in strongly inhomogeneous systems or systems with localized states due to the long range of Coulomb interactions. One consequence of this inherent difficulty is spurious charge transfer across inter atomic separations at which the interaction between the separated subsystems should have vanished leading to neutral atoms. Hartree-Fock (HF) exchange exactly cancels this type of self-interaction error, and hybrid functionals combine semi-local DFT with (some amount of) such exact exchange (EXX) energies (at increased computational cost over semilocal DFT). 39 Range-separated hybrids consider screened exchange integrals, retaining EXX only at short or long range. Long-range EXX 40, 41 is required to cancel the long-range Hartree self-interaction. Metallic systems, on the other hand, are incorrectly described by long-range EXX with a vanishing density of states at the Fermi level. Metals are thus studied with short-range hybrids, 42 which unfortunately do not cancel the long-range part of the Hartree self-interaction. These conflicting requirements for short vs. long-range EXX make it particularly difficult to accurately model the interaction of molecules with metallic surfaces with hybrid DFT. 43 One-electron self-interaction errors can generally be addressed with the self-interaction correction scheme by Perdew and Zunger, 27 improving, e.g., charge transfer energetics and the description of negative ions. The prediction of thermochemistry is, however, worsened over uncorrected DFAs, 44 and also equilibrium geometries of molecules and solids are not systematically improved. 45 Even for gapped systems that can be studied with long-range hybrids, fundamental problems in the predicted electronic structures can exist in the presence of strong static correlation. Since the auxiliary KS system is composed of non-interacting particles, T KS is computed from a single Slater determinant of KS orbitals. While the exact E XC [ρ] could compensate for the difference to the true, interacting electronic kinetic energy with significant multideterminantal contributions (unless the true ground state density should turn out to not be representable by a non-interacting system with local KS effective potential 21 ), approximations to E XC [ρ] typically lead to significant qualitative errors in e.g. predicting the energetics of multiradical molecules. 46 While KS spin-orbital occupation-constrained DFT can be used to compute corrections to some of these static correlation errors, 47, 48 in the general case of molecular interactions or molecule-metal interaction, where such constraints cannot be straightforwardly or uniquely defined or applied, static correlation is a fundamental problem for DFT and hybrid DFT. Long-range hybrids plus orbital-dependent random phase approximation 49 (RPA) correlation were shown to improve upon the description of strong static correlation in the dissociation limit of singly positively charged dimers. 50 Another shortcoming of DFAs is the incorrect prediction of total energies as a function of number of electrons N . Fractional values of N correspond to quantum mechanical ensemble averages of systems with different integer electron counts. Between adjacent integer values of N , the total energy scales linearly with N with derivative discontinuities at integer N . 51 Semi-local DFAs do not reproduce the linear behavior nor the derivative discontinuities but rather show a convex behavior of E total (N ), thus predicting too low energies for fractional N corresponding to a delocalization error favoring overly delocalized charge distributions over more localized ones with integer occupations. 52 Supplementing the KS Hamiltonian with Hubbard terms in DFT+U approaches [53] [54] [55] canceling 56 the spurious curvature of E total (N ) fundamentally improves the description of systems with strong d-electron or f -electron localization, such as several insulating transition-metal oxides and lanthanides and actinides, respectively. Predicting chemical reaction energies with DFT+U approaches is, however, difficult, as only total energies with same Hubbard U -parameters for each ion in products vs. reactants can be compared directly. Transition-metal oxide formation energies computed with average, empirical U -parameters applied both to oxides and metals are an improvement over GGA predictions, 57 at the prize of a worse description of the bandstructure of metallic phases. 58 The lack of the derivative discontinuity and resulting delocalization error for semi-local DFAs furthermore can be used to explain the DFA band gap problem of generally underestimating the band gaps of semiconductors and insulators. 59 Orbital-dependent DFAs were constructed to provide derivative discontinuity corrections that added to KS band gaps approximately yield the desired fundamental gaps. 60 Semi-local DFAs fail at describing van der Waals (vdW) interactions. Here, densitydensity convolution approaches [61] [62] [63] provide nonlocal DFA corrections which are quite successful in describing dispersion forces. Alternatively, force fields (with fixed or densitydependent dispersion coefficients) can correct the potential energy surfaces computed with semi-local DFAs by vdW interactions. [64] [65] [66] [67] [68] [69] For molecular systems of sufficiently low electron count N , there are wave function-based quantum chemistry methods, which can provide accurate electronic structures, not suffering from the above problems of DFAs. For extended systems, in particular those involving metallic states, obtaining results more accurate than those from semi-local DFAs is difficult, and experiments often serve as the benchmark for DFAs. In the following section, reference data that can serve for training electronic structure ML models are summarized. GROUND TRUTH FOR DFA ML MODELS Thermochemistry, thermochemical kinetics, and molecular interactions Experimental data for heats of formation of molecules are common benchmarks for DFAs and quantum chemistry (i.e. generally wave function-based) methods. The \"Gaussian-n\" theories of composite quantum chemistry techniques, 70,71 e.g., were benchmarked against experimental data on heats of formation, ionization potentials, electron affinities, and proton affinities, with ∼1 kcal/mol errors. 72, 73 Having thus established chemical accuracy of the approaches for these molecular properties, further accurate training and benchmark data for DFAs and ML models can be computed in high throughput with these quantum chemistry methods. Ramakrishnan et al. 74 used the Gaussian-4-Møller-Plesset-2 level of theory 75 to compute the heats of formation of over 100,000 molecules constituting the QM9 dataset (out of ∼ 2•10 11 molecules enumerated in the GDB-17 dataset 76 ). Using the Weizmann-4 quantum chemistry protocol, 77, 78 Karton et al. were able to compute training targets for atomization energies of 140 molecules and radicals in the W4-11 dataset 79 and of 200 molecules and radicals in the W4-17 dataset 80 with estimated accuracies better than 1 kcal/mol, also providing computed zero-point energies. Řezáč et al. 81, 82 computed the non-covalent interaction energies of 66 molecular complexes at 8 inter-molecular separations using coupled cluster theory 83 with triple excitations and complete basis set limit extrapolation. These S66/S66x8 datasets (later revised by Brauer et al. 84 ) are particularly useful for parameterizing or training approaches to describe dispersion energetics and forces. Gas phase reaction barrier height benchmarks were established by combining several quantum chemistry approaches and experimental results by Zheng et al. 85, 86 in the DBH24 dataset and by Zhao et al. 87, 88 in the BH-76 dataset. These two barrier height and other datasets are included in the GMTKN55 dataset by Goerigk et al., 89 which is a collection of datasets for thermochemistry, thermochemical kinetics, and non-covalent interactions. A further aggregate molecular chemistry benchmark dataset was compiled by Mardirossian and Head-Gordon. 90 Chan et al. 91 collected quantum chemistry benchmark data for transitionmetal (complex) chemistry in the TMC151 dataset. For heats of formation of solids, the tables of Kubaschewski et al. 92 provide a wide range of experimental data. These data were e.g. used to parameterize empirical schemes to combine DFT+U energetics for correlated transition-metal oxides with DFT for metallic phases in the Materials Project. 93, 94 Kirklin et al. 95 have collected experimental solid formation energies for benchmarking their Open Quantum Materials Database of GGA simulations of solids. For solid cohesive energies, experimental data collected in Refs. [96,97] was combined in the CE65 dataset, where zero-point contributions estimated from experimental Debye temperatures and DFT phonon calculations (neglecting minor dependencies of phonon frequencies for these solids on the choice of a solid state-appropriate GGA) were subtracted from the experimental cohesive energies as total solid atomization energy training targets. 37 Atomic structures The above-described thermochemistry datasets QM9, W4-11, and W4-17 also provide optimized equilibrium geometries of the considered molecules and radicals. Staroverov et al. 98 employed Gaussian-3X theory 99 to determine the equilibrium bond lengths of 86 neutral molecules and 10 molecular cations (forming the T-96R dataset), and the equilibrium structures and vibrational frequencies for 69 neutral and 23 cation dimers (forming the T-82F dataset). These data can be used to train models to yield accurate equilibrium molecular geometries and harmonic vibrational properties. For solids, the currently used benchmark and training data for structures are, as is the case for thermochemistry, based on experimental data with zero-point contributions removed from lattice constants and bulk moduli according to GGA phonon calculations or experimental Debye temperatures. Alchagirov et al. 100 used the latter approach entirely based on experimental data in a Debye model to remove zero-point contributions from the observed lattice constants and bulk moduli of 17 solids. Hao et al. 101 computed the phonon frequencies of 58 cubic solids using the PBE GGA 102 to remove zero-point contributions from the experimental lattice constants. Trepte et al. 103 similarly used PBE phonon calculations by Zhang et al. 97 to subtract zero-point contributions from the experimental bulk moduli of 62 solids as training target for ML DFA models. The advantage of removing zero-point contributions from the experimental lattice and elastic data is that the DFA training can directly minimize the error on these properties with few total energy predictions without also having to predict the computationally more costly phonon frequencies during training. Transition-metal surface chemistry Transition-metal surface chemistry constitutes an interesting challenge for DFAs, as spurious charge transfer problems between surface and adsorbates can occur and molecules can exhibit strong static correlation, while the metallic surface bandstructure requires a good description of metallic screening. Experimental results for 39 chemi-and physisorption energies on transition-metal surfaces were collected by Wellendorff et al. 104 and PBE zero-point contributions to be removed from the experimental results for DFA training were computed. These data were extended by one chemi-and one physisorption energy resulting in the ADS41 dataset. 43 Surface reaction barrier heights pose the additional challenge of delocalization errors in transition state geometries for DFAs. Mallikarjun Sharada et al. 105 collected ten measured surface barrier heights for molecular dissociation on transition-metal surfaces forming the SBH10 dataset. This dataset was extended by Tchakoua et al. 106 by 7 more surface reaction barrier heights resulting in the SBH17 dataset. These surface chemistry data are computationally more expensive to train ML DFA models against than the bulk solid data above. The considered bulk systems typically are cubic and highly symmetric, such that the lattice constant is the only structural degree of freedom to be optimized to predict equilibrium structures. For surface and adsorbate systems, nuclear coordinate degrees of freedom for surface and adsorbate atoms need to be relaxed, too, and the slab models typically contain on the order of 20 transition-metal atoms, thus rendering each total energy calculation significantly more expensive than in the small primitive unit cell bulk cases. These surface chemistry benchmarks from single-crystal experiments are, however, very valuable as their simulation requires accurate description of both extended and localized states and their interactions. Charge densities Medvedev et al. 107 have benchmarked DFAs for their prediction of molecular charge densities compared to accurate quantum chemistry densities, finding that while newly developed DFAs have become better at predicting energies, the prediction of densities has been sacrificed to some degree. Quantum chemistry charge densities are thus an important training target for accurate ML DFAs. ML efforts reviewed in the following that consider such density metrics during their training typically computed quantum chemistry densities as part of the studies, with public quantum chemistry charge density benchmark data (rather than DFT densities) being hard to find. ML XC FUNCTIONALS We divide ML DFAs into two categories. The first category summarized in the following consists of density functionals represented by mathematical expressions of explicit, tractable functional form with a low to moderate number of fitted numerical coefficients. The second category consists of functionals represented by neural networks with linear, convolutional, and non-linear activation layers, 108 where the neural network weights typically constitute a much larger space of fitting degrees of freedom than the coefficients in the former explicit density functionals forms. Semi-empirical DFAs with explicit functional forms A major (and lasting) impact on the adoption of GGAs for computational chemistry had the development of semi-empirical DFAs fitted against thermochemistry by Becke (followed a few years later by the non-empirical PBE 102 functional and its lasting impact on computational materials science). In Becke's hybrid DFA B3PW91, 109 relative weights for exact, local, semi-local exchange and local and semi-local correlation were fitted against the G2 thermochemistry dataset 110 (the popular B3LYP functional replaces PW91 111 correlation with LYP 112 correlation 113 ; Vargas-Hernández 114 employed Bayesian optimization 115 to choose the weighted exchange and correlation functionals and to optimize the weights). In Becke's B97 hybrid, 116 exchange and correlation inhomogeneity correction factors were introduced. These factors are polynomials in fractions of the reduced density gradient ∼ |∇ρ|/ρ 4/3 , and the polynomial coefficients were also fitted against the G2 dataset. Mardirossian and Head-Gordon 117 extended this work to a long-range screened hybrid and nonlocal correlation, ωB97X-V, identifying which powers led to the best fit to a wider range of molecular benchmark data, also optimizing the empirical coefficients of the used VV10 nonlocal correlation functional, 63 and eliminating a few fitting degrees with constraints. Liu et al. 118 fitted a meta-hybrid with nonlocal correlation functional on a wide range of molecular chemistry benchmarks including thermochemistry, barrier heights, isomerization energies, excitation energies, non-covalent interactions, dipole moments, and bondlengths. Following the strategy of fitting polynomial coefficients to molecular thermochemistry, Hamprecht et al. 119 optimized inhomogeneity correction factors for a GGA with a small increase in number of polynomial coefficients compared to the Becke functionals, starting the development of the HCTH-family of XC functionals. [120] [121] [122] Truhlar and co-workers developed the semi-empirical Minnesota XC functionals, which includes meta-GGAs and hybrid meta-GGAs. [123] [124] [125] [126] [127] [128] During the development of this XC functional family, the range of training data was widened, including solid properties in addition to molecular chemistry. In some of the Minnesota functionals, analytical constraints were used to reduce the large number (up to over 50) of fitting degrees of freedom. 129 The performance of the strongly constrained and appropriately normed (SCAN) meta-GGA 34 clearly showed the benefits of fulfilling an increasing number of known analytical constraints for XC functionals. 130, 131 Sparrow et al. 132 expressed inhomogeneity factors for GGA exchange and correlation in a spline basis facilitating straightforward enforcement of equality and inequality constraints, resulting in the CASE21 functional for molecular chemistry. In addition to coefficient elimination for equality constraints, inequality constraints were implemented as penalties during exchange enhancement factor optimization of the meta-GGA MCML by Brown et al. 37 for bulk, surface, and gas-phase chemistry. This constrained meta-GGA optimization was extended by Trepte et al. 103 to a simultaneously optimized, nonlocal VV10 63 correlation term. Rather than imposing analytical constraints, overfitting in the Bayesian error estimation functionals (BEEF) was suppressed by a quadratic (Tikhonov 133 ) regularizer. 96, 134, 135 This ridge regression approach 136 led to a fast decay of the magnitude of polynomial coefficients with increasing polynomial powers in the series used to expand the GGA and meta-GGA exchange enhancement factors. In contrast to many non-and semi-empirical XC functionals, the BEEF functionals enhance exchange for a homogeneous system over the exact local exchange in this limit. Similar exchange enhancement increase in the homogeneous limit by a few percent was also observed by Kovács et al. 137 for meta-GGA exchange enhancement fits to lattice constants, solid cohesive energies, and band gaps when not imposing this LDA limit. Generally, the XC functional fitting approaches have evolved into using generic forms of enhancement or inhomogeneity factors with a large number of fitting degrees of freedom. Gastegger et al. 138 instead applied genetic programming 139 to find mathematically simple forms of XC functionals performing well for molecular chemistry benchmarks. Ma et al. 140 used similar symbolic regression techniques (by means of regularized evolution 141 ) to evolve generations of XC functionals starting from preexisting ones to new ones with improved performance on target datasets. The above-reviewed semi-empirical XC functionals are optimized to yield quantitatively improved performance for desired chemistry target metrics. Fundamental DFA issues of the different levels of theory of hybrids, GGAs, and meta-GGAs are generally unlikely improved upon qualitatively by numerical optimization of these mathematically relatively simple XC functionals. Much more complex DFAs, such as neural network-based approaches reviewed below, might offer an opportunity to arrive at such qualitative improvement. Accurate, but system or materials class-specific functionals could also be learned with simpler ML models. Riemelmoser et al. 142 used Gaussian kernel regression with nonlocal density features to learn ML functionals reproducing RPA correlation energies for diamond and water, respectively. ⇢(r) |r⇢(r)| ⌧ (r) Backpropagation ... E XC (r) E XC ⇢(r) E XC |r⇢(r)| E HF (r) E screened (r) Neural network DFAs Neural network XC functionals are functionals of density, density gradient and additional local electronic properties, such as KS kinetic and EXX energy densities, and are trained to yield accurate target XC energies and typically also accurate ground state densities (Figure 2 ). The automatic differentiation-based backpropagation technique 143 commonly used for optimizing the neural network weights for loss function minimization during training is here applied to also compute the gradient of the XC energy with respect to the local density and energy density inputs. These derivatives are required to compute the KS potential. Nagai et al. 145 trained a neural network meta-GGA on the quantum chemistry densities and atomization energies of only the three molecules H 2 O, NH 3 , and NO. The neural network weights were stochastically optimized by selfconsistently computing the ground state densities and energies of the three molecules and H, N, and O atoms for randomly perturbed weights. Remarkably, the resulting XC functional performs well and even outperforms existing functionals across benchmark databases containing over 100 molecules. The implied transferability from a very small training set to other molecules and also to reaction barriers is very promising. This neural network meta-GGA work was extended by enforcing five physical constraints on exchange and correlation each, and including the ionization potentials as an additional training target besides densities and atomization energies of the molecules H 2 O, NH 3 , and CH 2 . 144 This XC functional was trained as an XC enhancement over the SCAN meta-GGA. While the resulting XC functional bares some similarity with the SCAN functional (Figure 3 ), it is reported to outperform SCAN on lattice constant and molecular atomization benchmarks. Kirkpatrick et al. 146 developed a neural network XC functional addressing the total energy vs. fractional particle number and derivative discontinuity problem. Their DeepMind21 (DM21) functionals take point by point in real space charge density and gradient, KS kinetic, unscreened and long-range EXX energy densities as inputs. The training was performed nonselfconsistently on B3LYP densities and KS orbitals. The loss was computed as the energy differences to large sets of molecular chemistry benchmarks. The change in energy a single selfconsistent field iteration would cause starting from the B3LYP orbitals was estimated perturbatively, and this change was penalized as an additional term in the loss function. With this approach, the neural network weights could be optimized using the gradient obtained via backpropagation, as no KS selfconsistency cycles were required during training. This enabled training a neural network with ∼ 4 • 10 5 trainable weights (Nagai et al. 145 used ∼ 2 • 10 4 trainable weights) on large datasets, which were extended by densities of fractional charges and spins to train the correct piece-wise linear behavior with energy vs. particle number derivative discontinuities. Energies and charge densities were interpolated linearly between integer particle numbers as dictated by quantum mechanical ensemble averages, spin densities were interpolated linearly between degenerate spin states, and the KS inversion technique due to Wu and Yang 147 was used to decompose the interpolated densities into KS orbitals for computation of the required DM21 input energy densities. Several variants of the DM21 functional were developed with different imposed constraints (fractional charge and spin constraints and homogeneous electron gas limit), showing promising performance on molecular benchmark data. Tests of two of these variants for solids, i.e., materials classes outside the training data, are presented in the outlook at the end of this review. Gedeon et al. 148 trained a neural network XC functional for correct derivative discontinuity behavior for 1D systems with the help of an additional neural network input feature explicitly depending on the total (fractional) particle number. Wang et al. 149 iteratively trained a neural network GGA by using backpropagation to optimize the neural network at fixed charge densities and then using this neural network GGA to recompute charge densities in KS selfconsistency cycles at fixed neural network weights. Chen et al. 150 similarly performed iterative loops of neural network optimization at fixed orbitals and KS solution at fixed neural network weights for DFT and hybrid DFT. Rather than employing the techniques in the above approaches to XC neural network optimization using stochastic approaches, perturbative approaches, and iterative loops between neural network backpropagation-based optimization and KS selfconsistency cycles, there are efforts to make the KS solution with its challenge of required selfconsistency between KS orbitals and density differentiable. Li et al. 151 implemented a differentiable KS solution for 1D systems, which they trained on accurate solutions possible in this reduced dimensionality within the density matrix renormalization group (DMRG). 152 Their loss function penalizes differences in the converged KS density and the DMRG one as well as the total energy difference at each KS iteration to the DMRG energy. This approach enhances the smooth convergence rate of the KS cycles towards the DMRG solution, with the KS equations effectively acting as a regularizer. The KS regularization helps the ML functional learn smooth functional derivatives not only at the converged solution, but along the KS convergence trajectory. The regularization was furthermore found to enhance the transferability of the XC functional. 153 Kasim and Vinko 154 implemented differentiable KS solutions in three dimensions, and Kasim et al. 155 extended this work to a differentiable DFT and HF code. Starting from accurate ground state densities instead, Tozer et al. 156 used a neural network to model the XC potential derived from configuration-interaction densities of atoms and small molecules using the KS inversion technique by Zhao et al. 157 for finite systems. ∆-ML CORRECTIONS TO DFT The approaches reviewed in the previous section learn approximations to the XC functional E XC [ρ], and functional differentiation yields the effective one-body KS potential used to compute KS orbitals and thus KS kinetic energies, EXX integrals, and other orbital-dependent energies. Instead of using the KS potential from the machine-learned XC functional and correspondingly solving the KS equations selfconsistently, the ∆-ML methods reviewed here provide post-DFT and post-hybrid DFT corrections to E XC [ρ], where the ground state density ρ and KS orbitals are kept fixed at the solution from another XC functional. A resulting simplification for such ∆-ML methods is that they need not provide functional derivatives, as one-body KS potentials are not computed. This enables the usage of non-differentiable ML approaches such as the decision tree ensemble method of gradient boosting. 158, 159 Wang et al. 160 used the popular gradient boosting implementation XG-Boost 161 to learn a density and density gradient-dependent (i.e. GGA-type) XC functional to be evaluated non-selfconsistently on PBE charge densities. This functional provides an XC energy correction on top of PBE XC, which was trained to improve upon molecular thermochemistry benchmarks. Similarly, Bogojeski et al. 162 used kernel ridge regression to train a model correcting selfconsistent PBE-based energies to coupled cluster results. This XC model takes nonlocal density features as input (a second kernel ridge regression model was developed to predict these density features from the atomic structure alone). They found these ∆-XC energy corrections could be regressed with lower errors than coupled cluster or DFT energies directly, constituting another advantage of ∆-ML corrections to XC energies. Another family of approaches non-selfconsistently provides correlation energies post selfconsistent DFT or HF. Margraf and Reuter 163 developed a kernel-based approach using nonlocal charge density features that provides non-selfconsistent correlation energies trained on quantum chemistry energies. Chen et al. 164 developed a neural network-based approach for post-HF correlation energies also trained on molecular quantum chemistry. They used the local one-body density matrix as model input and trained an ensemble of neural networks. Deviation in the ensemble was used as a model uncertainty estimate in an active learning approach to limit the number of computationally expensive quantum chemistry simulations for training data. Cheng et al. 165 used Gaussian process regression 166 to develop a post-HF model for correlation energies using the one-body density matrix. They learned a density matrix functional of features of the HF orbitals and found good transferability of the model from training on the QM7 dataset 167 to significantly larger molecules from the GDB-13 168 dataset. One-body density matrix-derived features were similarly used by Ng et al. 169 to train neural networks to predict post-HF correlation energies, finding good transferability from training on small water clusters to predictions on large water clusters and from training on short alkanes to predictions on longer alkanes. Han et al. 170 devised a semi-local ML XC functional for post-HF correlation energies trained against Møller-Plesset-2 171 data. Their functional takes charge density and gradient, electronic kinetic energy, and a weighted sum of the occupied orbital densities as local input. For the latter sum, the orbitals were weighted reciprocally with the energy difference of the HF energy level of the occupied orbital to the virtual orbitals, in order to mimic the energy denominators in second order perturbation theory in this feature. ATOMIC STRUCTURE-DEPENDENT XC CORRECTIONS While the ∆-ML methods summarized in the previous section predict post-DFT and HF corrections based on electronic features, atomic structural information can be employed to parameterize such XC corrections, too. Ramakrishnan et al. 172 used kernel ridge regression to non-selfconsistently correct HF to Møller-Plesset-2 and coupled cluster results as well as Møller-Plesset-2 to coupled cluster. The corrections are expressed as sums over terms measuring atom by atom the similarity of two structures through kernel functions exponentially decaying with atomic coordinate distances. A resulting ML-model was shown to improve B3LYP-based reaction energies of organic molecules to chemical accuracy, both correcting over-and severely underestimated DFT reaction energies (see Figure 4 ). The DFT+U method constitutes an atomic structure-dependent XC correction, as the Hubbard terms in this method are used to penalize fractional occupation of local density matrices in the basis of, e.g., correlated transition-metal or rare-earth site-centered atomic orbitals. Using genetic programming with experimental transition-metal oxide heats of formation as training data, ∆-ML models were found that featurizing local density matrices enable reaction energy predictions based on different levels of theory for products and reactants. 58 Localized states in the correlated oxides were treated at the DFT+U level with site-dependent, first-principles U -parameters from linear-response theory, and delocalized states in the metallic phases were treated at the DFT level. Empirical force fields are ubiquitously used to supplement semi-local DFAs with dispersion energetics. Proppe et al. 173 used Gaussian process regression featurizing the individual pairwise terms of such vdW force fields to arrive at improved agreement with coupled cluster results. Variance prediction was used to select systems for coupled cluster benchmark calculations in an active learning framework. A non-selfconsistent ∆-ML approach with an atomic structure and charge densitydependent XC energy correction was developed by Dick and Fernandez-Serra. 174 In this work, the selfconsistent DFT charge density was projected onto atom-centered basis functions, defined as spherical harmonics times a radial function confined to a spherical shell around the atom. In analogy to ML inter-atomic potentials, the ∆-XC energy correction was defined as a sum over atomic contributions, where each of these contributions is modeled by a neural network with the charge projections around the corresponding atom as input. As this non-selfconsistent ∆-ML approach does not provide corrections to the charge density, corrections to the atomic forces were trained with additional neural networks. The models were trained and tested on water clusters, for which in turn coupled cluster-based force field parameterizations 175, 176 were used as reference data. Dick and Fernandez-Serra 177 extended this work to refined atom-projected density features that account for the charge density difference of the system to atomic reference densities, and they used backpropagation to compute derivatives with respect to these density features. They thus compute the functional derivative of their model with respect to the density resulting in an ML XC functional that can be used selfconsistently. Again benchmarking their model for water, they find, e.g., an improved description of charge accumulation along the OH bonds compared to semi-local DFAs (Figure 5 ). ML KS HAMILTONIAN SUBSTITUTIONS ML approaches are not only used to find approximations to E XC [ρ], they can also be employed, e.g., to approximate the non-interacting kinetic energy functional T KS [ρ] in Eq. 1. Such methods are not necessarily aimed at increasing the accuracy of DFT simulations, but typically rather at their acceleration. An explicit density-only functional for the noninteracting kinetic energy in KS orbital-free DFT would substantially reduce the computational cost of DFT, which for semi-local DFT with T KS computed from KS orbitals is dominated by the diagonalization of the auxiliary Hamiltonian with KS one-body potential. Burke and coworkers developed neural network models for T KS [ρ] for 1D systems. 178, 179 Tan et al. 180 implemented a differentiable, orbital-free DFT code for efficient training of neural network-based approximations to T KS [ρ]. Finding that functional derivatives of neural network models of T KS [ρ] were typically noisy and not generally useful for implementing a minimization scheme of the KS orbital-free energy functional (and regularization of the functional derivatives unfortunately correlated with a loss of accuracy of T KS [ρ] 179 ), Brockherde et al. 181 machine-learned the map from external potential to ground state charge density instead of learning to approximate T KS [ρ]. This approach absolves from a total energy functional minimization with respect to the density, and functional derivatives are thus not required. It was furthermore found that the approach of predicting the charge density yielded lower errors with moderate amounts of training data than learning to directly predict the energy of the system from the external potential (see Figure 6 ). Given the promise of significantly improved computational efficiency of such an orbital-free DFT approach, further ML models directly predicting the charge density have been developed. [182] [183] [184] [185] [186] [187] Shao et al. 188 furthermore learned maps from external potential to the one-body density matrix. Another avenue for electronic structure ML models targeting computational efficiency is the substitution of expensive energy contributions, such as EXX, with cheaper ML approximations. Cuierrier et al. 189 used a neural network to train a semi-local approximation of exchange exploiting the fourth order expansion of the exchange hole 190 as an input feature, where a relatively small neural network was optimized with a quasi-Newton approach. Their training target was EXX from hybrid DFT. Lei and Medford 191 trained a neural network to reproduce B3LYP XC with nonlocal density descriptors. Yu et al. 192 used Bayesian optimization to find Hubbard-U corrections that best reproduce the behavior of EXX in short-range screened hybrid DFT for solids. Bystrom and Kozinski 193 used Gaussian process regression to train an exchange functional reproducing EXX with a combination of semi-local and nonlocal density features. They find that their ML model could be used as a computationally cheaper replacement for EXX in hybrid functionals and show good agreement with hybrid DFT for thermochemistry and ioniziation potentials. Overall, these approaches aim at reproducing the effects of EXX on the electronic structure at the cost of semi-local DFT. CHALLENGES AND OPPORTUNITIES The perhaps surprising usefulness of the simplest of DFAs, the LDA, even for inhomogeneous systems, was explained by XC energies only depending on the spherical average of the XC hole and the LDA fulfilling the important sum rule of this hole accounting for one missing electron. 194 Density gradient corrections do not necessarily improve upon the predictive performance of the LDA, unless this sum rule is fulfilled. It was the real-space cut-off in the exchange hole gradient expansion introduced by Perdew 195 that enabled the development of GGAs fulfilling the sum rule and outperforming the LDA for energetics and atomic structures. The success of the seemingly crude LDA and the reason for sum rule-fulfilling GGAs being able to outperform the LDA can thus be rationalized through physical understanding. ML models, on the other hand, do not necessarily allow for such insights. Even with the simpler reviewed ML models with only a moderate number of fitting degrees of freedom, it cannot necessarily be excluded that the improvement over existing approaches merely consists of reducing error bars on the well-known benchmark data sets, 196 potentially at the price of e.g. sacrificing the description of the central quantity of DFT, the charge density, for improved reaction energy differences, 107 and thus potentially developing XC functionals that yield \"right answers\" for the \"wrong reason\". 197 These empirical methods could show accidentally improved energetics with respect to some benchmarks without having led to improved physical approximation of electronic XC. To highlight the promise that ML XC models hold, but also challenges in their transferability, we will compare here the performance of ML XC models to systems far outside their training and validation data. We begin this discussion with a simple test of the XC models for their performance on hydrogenic ions (Figure 7 ). In these one-electron systems, accurate XC should exactly cancel the spurious one-electron Hartree interaction. The first neural network XC model (NN) by Nagai et al., 145 only trained on three molecules but showing promising performance for a range of molecular thermochemistry, did not explicitly incorporate analytical constraints nor was it trained e.g. on the exact XC density of the H atom. Its performance for hydrogenic ions turns out be relatively poor. The physically constrained pcNN 144 by the same authors, also only trained on three molecules, yields accurate XC ener- gies for these ions. From the DM21 family of functionals, we consider the variant DM21 with fully imposed fractional charge and spin piece-wise linear energy behavior and the variant DM21mu with imposed homogeneous electron gas limit. Both DM21 and DM21mu show reasonable accuracy for hydrogenic ions with Z < 5, where the more positively charged ions are likely too far from the training data. The derivative discontinuity trained for in the DM21 functional via fractional total charges on molecular systems is of importance for correcting KS gaps to the physical, fundamental gap of semiconductors and insulators. We thus test here the performance of DM21 functionals trained only on molecular data for a bulk system: the semiconductor Si (Figure 8 ). PBE, as is typical for DFAs, significantly underestimates the Si band gap. The DM21 functional shows poor performance for the Si bandstructure in general. The spurious oscillations in band dispersion as a function of wave vector are likely due to DM21 not being parameterized in the density and energy gradient neural network input tuples relevant for solids here. The bandstructure is overall compressed in energy range and with that the band gap, while one would have hoped that a functional reproducing derivative discontinuities would yield an enlarged band gap with respect to semi-local DFAs. DM21mu, on the other hand, yields a smooth band structure and an increased band gap in approximate agreement with experimental and GW 198 results. 199 This is another example of the importance of physical constraints on the ML XC models: although DM21mu was only trained on molecular systems, the homogeneous electron gas constraint seems to have extended the range of applicability over DM21 significantly. PBE DM21 DM21mu a) -12 -10 -8 -6 -4 -2 0 2 It is interesting to note that DM21mu reduces the sp-bandwidth of Si compared to PBE. DFAs have a general problem of overestimating bandwidths. 204 Using bandstructures determined from angle-resolved photoemission spectra as accurate training data for ML DFAs could be an option to incorporate the underlying many-body effects into the XC functional (if one chooses to interpret the KS eigenlevels as quasi-particle energies). If DM21mu is transferable to semiconductors in general, will need to be tested on more systems. Extending training data to GW quasi-particle bandstructures could be of help to teach the functional derivative discontinuities explicitly for solids (and this would likely cure minor flaws in the DM21mu Si bandstructure such as the lowered conduction band at the L-point). L Γ X W K E - E Fermi [eV] b) -12 -10 -8 -6 -4 - 2 0 2 L Γ X W K E - E Fermi [eV] c) -12 -10 -8 -6 -4 -2 0 2 L Γ X W K E - E Fermi [eV] With these very encouraging results for DM21mu for a semiconductor bandstructure, we now turn to a problem where beyond semi-local DFT approaches typically perform worse than the LDA and GGAs: itinerant ferromagnetism. Figure 9 shows the magnetic moment of bulk Fe computed with a number of different analytical, semi-empirical, and ML DFAs and beyond semi-local DFT methods. Unfortunately, the majority of advanced XC functionals shown here are not able to reproduce the metallic screening of exchange sufficiently and correspondingly yield too large magnetic moments. This problem was addressed in the strongly constrained SCAN functional by deorbitalization: 205 the KS kinetic energy depen- 2 2.2 2.4 2.6 2.8 3 3.2 3.4 3.6 SCAN-L LSDA Wu-Cohen PBE PBESOL TPSS OFR2 MCML SCAN mBEEF pcNN r 2 SCAN revM06-L HSE06 PBE+U resp HF SR ω=0.4 Magnetic moment / Fe-atom [µ B ] Magnetic moment per primitive body-centered cubic unit cell of bulk Fe obtained with different DFAs: SCAN-L, 200 LSDA, 27 Wu-Cohen, 30 PBE, 102 PBEsol, 29 TPSS, 33 OFR2, 38 MCML, 37 SCAN, 34 mBEEF, 134 pcNN, 144 r 2 SCAN, 201 revM06-L, 35 and HSE06. 202 PBE+U resp result with first-principles Hubbard parameter from linear response from Ref. [58]. HF SR ω=0.4 is short-range screened exchange with the same inverse screening length of 0.4/Bohr as for long-range screened exchange used as input feature in the DM21 functionals. The dashed line indicates an experimental value of 2.13 µ B . 203 dence was replaced by a density functional for the kinetic energy involving the Laplacian of the charge density, and the resulting SCAN-L 200 and OFR2 38 show significantly improved magnetic moments, albeit at the prize of sacrificing constraint fulfillment. Unfortunately, higher rungs of theory such as the short-range screened hybrid HSE06 202 do not lead to an improved description here. Employing a Hubbard-U term to compensate the spurious GGA curvature for fractional electron count even increases the magnetic moment further. Finally, we computed the Fe magnetic moment with short-range screened HF with the same screening length used for long-range screened EXX in the DM21 and DM21mu features, leading to largely exaggerated magnetic moments. Unfortunately, both DM21 and DM21mu show such exaggeratedly large magnetic moments, too (roughly estimated from differences in the spin densities of states computed non-selfconsistently with PBE KS orbitals). Another example for a challenge for ML-DFA or a ∆-ML model development are models that should be simultaneously accurate for strong chemisorption and weak dispersion forces for chemistry on transition-metal surfaces. Part of the challenge is that the reference data typically consist of experimental binding and reaction energies only. A lack of quantumchemistry or experimental references for transition-metal surface chemistry potential energy surfaces or even only for bound adsorbate geometries currently precludes the training of general, e.g. ML-interatomic potential-based ∆-ML models to improve upon DFT for these chemistries. Semi-empirical models with relatively few fitting degrees of freedom for semilocal XC and non-local correlation are thus currently more suitable to be optimized with respect to the very limited amounts of transition-metal surface chemistry reference data. Ref. [104]). PBE, VCML-rVV10, SCAN, and results from Ref. [103]. Shown as an example for physisorption is the binding of benzene (C 6 H 6 ) and for chemisorption the binding of carbon monoxide (CO). A more fundamental challenge for DFAs is a general trend towards predicting too strong chemisorption, and supplementing such a DFA with attractive dispersion forces will generally only worsen the overbinding behavior for chemisorption. 43 Figure 10 shows the accuracy of a few DFAs for predicting chemi-and physisorption energies on transition-metal surfaces. Compared are the deviations from experiments for the PBE 102 functional, PBE supplemented with dispersive forces fields of D3-type 65 with Becke-Johnson 206 damping 207 and the Bayesian optimization-tuned PBE-D3(BJ)-BO, 173 SCAN 34 , SCAN supplemented with a nonlocal VV10-type 63 density functional (SCAN-rVV10), 208 and the bulk and surface chemistry-optimized VCML-rVV10. 103 With binding of C 6 H 6 as representative example for physisorption and of CO for chemisorption, PBE consistently underbinds the former and overbinds the latter. Adding dispersion energetics to PBE in form of the PBE-D3(BJ) and PBE-D3(BJ)-BO functionals improves qualitatively the binding energy of C 6 H 6 on Cu, Ag, and Au, which at the PBE-level is barely bound by ≲ 0.05 eV per C 6 H 6 . However, both PBE-D3(BJ) and PBE-D3(BJ)-BO overestimate physisorption energies of C 6 H 6 in comparison to experiments, and the overbinding of PBE for chemisorption is significantly increased. PBE-D3(BJ) and PBE-D3(BJ)-BO perform very similarly for the surface chemistry examples, PBE-D3(BJ)-BO (over-)binding slightly more strongly by ∼ 0.03 eV on average. Simulations using the SCAN functional predict moderate overbinding of C 6 H 6 on Pt and reduced underbinding on Cu, Ag, and Au. CO is more strongly overbound than is predicted with the PBE functional. The SCAN-rVV10 functional was developed by fitting rVV10 parameters against the S66 dataset. Physisorption of C 6 H 6 on Cu, Ag, and Au is described well by this functional, but for C 6 H 6 on Pt and for CO chemisorption, the overbinding of SCAN is worsened. In the VCML-rVV10 approach, not only rVV10 was reparameterized, but also the semi-local part of the DFA. Physisorption on Cu, Ag, and Au is described accurately, while all other considered systems are overbound. The simultaneous reparameterization of semi-local XC allowed to suppress overbinding for chemisorption in comparison to the other considered functionals, in particular the functionals with vdW terms. However, overbinding of CO is only suppressed by ∼ 0.03 eV on average compared to PBE. Overbinding of chemisorbed species could not be suppressed further without breaking analytical constraints or sacrificing physisorption energetics or description of bulk lattice constants. 103 This example demonstrates difficulties in optimizing for competing interaction types with such simpler types of DFA models. Quite generally, the description of molecular chemistry, correlations due to strongly localized states and metallic screening and delocalized states within the same electronic structure approach is an inherently difficult problem (and a very important one, given the technological importance of interfaces between oxides and metals and their defect chemistries and heterogeneous catalysis). Since imposing analytical constraints and higher levels of theory in semi-local DFT and hybrid DFT turn out to worsen the description of metallic screening, a successful XC approximation is likely going to be a highly nonlocal one. Given this likely complexity of an accurate XC functional, here is thus an opportunity for ML approaches in developing such needed XC approximations. A major challenge for extending accurate ML DFA and ∆-ML models to extended systems and metallic phases in particular is that wave-function methods will generally not be applicable. While there is progress in advanced electronic structure methods for solids, [209] [210] [211] extending approaches to also yield accurate densities important for XC model development, once sufficient accuracy will be reached for energetics leading to a range of training data, will be a major challenge in itself. Even if sufficient amounts of accurate training and validation data to build ML XC models are available, a remaining question will be how practical these models are for use in simulations in terms of their computational cost and numerical stability. A stability issue with DFA approximations (empirical and non-empirical) of increasing complexity can be an increased sensitivity with respect to basis set choices. Lehtola and Marques 212 have shown that several XC functionals are numerically sensitive to the number of radial quadrature nodes for evaluating atomic XC energies, requiring very fine integration grids with a large number of nodes for accurate, converged results in some cases. Here, we perform a similar convergence test with respect to radial integration grids for the O atom (see Figure 11 ). Similar to the findings of Lehtola and Marques, 212 the more complex meta-GGA SCAN is found to be more sensitive to the integration grid than the GGA PBE, where PBE converges much faster with respect to the number of quadrature nodes than the other, more complex DFAs tested here. To test the corresponding stability of ML approaches, we test three representative approaches: pcNN, which was trained as an enhancement over SCAN showing improved but similar performance for atomic structural Figure 11 : Convergence of computed XC energies for atomic O at fixed HF orbitals as a function of number of radial grid quadrature nodes. The absolute difference with respect to the results at 1000 nodes is shown. and energetic metrics, DM21, as a more complex neural net-based ML DFA than pcNN, and the gradient boosting ∆-ML approach ML-PBE. 160 ML-PBE not being differentiable, the numerical sensitivity is worst for this approach. Even at 500 quadrature nodes, the O XC energy has not converged below a residual error of 1 kcal/mol. While this ∆-ML approach would not suffer from selfconsistent cycle instabilities, as selfconsistent iterations are only performed at the PBE-level, and while there could be error cancellation in ∆-ML total energy differences, this shows that predictions with this approach show a sensitivity to the basis set, that could limit its accuracy unless trained for a specific basis set or integration grid. Despite its similarity to SCAN, pcNN shows a stronger numerical sensitivity than the former with an order of magnitude higher residual error in integrated O XC energies at 500 grid points. The more complex DM21 shows a similar XC energy convergence rate as pcNN. This shows that ML DFA and ∆-ML models irrespective of moderate or large model complexity can display numerical sensitivity which could render their practical use more challenging than that of simpler DFAs. Regularization techniques, relevant in particular for stable functional derivatives of ML DFAs, 151 will play a crucial role in reducing numerical problems of these ML models. METHODS The presented ML DFA benchmarks in the previous section were computed with the following tools. XC energies for hydrogenic ions were evaluated on their analytical nonrelativistic densities through numerical quadrature via SciPy. 213 XC energies for the O atom were computed on HF ground-state orbitals with spherically averaged densities. HF orbitals were computed using the OPIUM code. 214 Spherically averaged charge, kinetic, EXX, and screened EXX energy densities were computed with these HF orbitals. B-splines (as implemented in SciPy) were used to interpolate from the employed OPIUM grid with 1335 radial grid points to sparser grids for testing numerical XC energy integration stability. For this grid convergence testing, 3 to 1000 Gauss-Legendre quadrature nodes t and corresponding weights w were transformed as t ′ = 1/(1 -t) -1/2 and w ′ = w/(1 -t) 2 to evaluate the semi-infinite radial integrals. Charge density and KS orbitals for bulk Si were computed using the Quantum Espresso plane-wave DFT code, 215 with a plane-wave cut-off of 600 eV and 16×16×16 k-points sampling the first Brillouin zone. Si ionic cores were described by an SG15 optimized normconserving Vanderbilt pseudopotential. 216, 217 Spin density and KS orbitals of bulk Fe were computed with the Vienna Ab initio Simulation Package 218 with a 500 eV plane-wave cut-off and 28×28×28 k-points sampling the first Brillouin zone. Fe ionic cores were described by a projector-augmented wave 219 (PAW) potential. 220 An additional PBE calculation of bulk Fe was performed using Quantum Espresso and a higher plane-wave cut-off of 600 eV and a norm-conserving SG15 pseudopotential, to avoid having to compute PAW augmentation terms in the evaluation of DM21 and DM21mu. DM21 and DM21mu ML XC functionals were evaluated using the C++ interface provided at [ 221]. The corresponding bandstructure calculations were performed non-selfconsistently with charge density and KS kinetic, EXX, and long-range screened EXX energy densities evaluated with PBE KS orbitals. The zero-wave vector divergence of the Coulomb potential for the EXX computations was treated using the method due to Gygi and Baldereschi. 222 Band dispersion plots were interpolated with the Wannier90 code. 223 Surface adsorption energies were computed with VASP at plane-wave cut-offs of 1000 eV using PAW potentials to represent ionic cores of transition-metal and adsorbate atoms. The surfaces were modeled as slabs of four layers of transition-metal atoms separated by at least 15 Å of vacuum from their periodic images. The two bottom layers were fixed at their bulk positions. Forces on the two top layers and adsorbates were relaxed with residual forces of less than 10 -2 eV/ Å. Brillouin zone sampling was performed with in-plane k-point spacings of at most 0.018 Å-1 . SUMMARY Quantum chemistry benchmarks and advances in ML approximations to electronic XC enable the development of DFAs targeting chemical accuracy for a range of molecular chemistries. With semi-and nonlocal charge and energy density inputs, ML XC models can be constructed correcting for fundamental limitations of existing DFAs. A challenge for developing chemically accurate ML models for extended systems is the computation of accurate training benchmark energies and densities for these systems. Numerical stability and transferability issues to systems outside the training and validation data are a general concern. Putting these new ML XC developments to the test by the computational chemistry research community will reveal the strengths of these methods and where further development and training data are required. Charge density functional-based Atomic structure-based Machine learning approaches to improving electronic structure predictions Neural networks & other ML regression techniques Closed mathematical forms & Genetic programming Machine-learned XC functionals Post-DFT corrections / Δ-ML ML Kohn-Sham Hamiltonian supplements Techniques Electronic and geometric features ML DFT methods Figure 1 : 1 Figure 1: Overview of ML approaches to increasing the accuracy of electronic structure predictions based on electronic or atomic structural features. Machine-learned XC functionals are trained on high-accuracy benchmark data to improve upon the predictive power of existing DFAs. Post-DFT and ∆-ML methods provide improved energetics on fixed DFT charge densities, and other ML approaches supplement the Kohn-Sham Hamiltonian with Hubbard and dispersion terms. Figure 2 : 2 Figure 2: Schematic of a neural network-based XC functional. Local features of the charge density ρ at position r and, depending on the XC functional type, kinetic (τ ) or EXX energy densities are inputs to the neural network yielding the XC energy E XC (r). With the help of backpropagation, the gradient of the XC energy with respect to the inputs can be obtained, from which the effective one-body KS potential is computed. Figure 3 : 3 Figure 3: Comparison of the XC enhancement of the PBE, 102 SCAN, 34 and neural networkbased XC functionals without (NN) and with physical constraints (pcNN) for different values of Wigner-Seitz radius r s , reduced density gradient s, KS kinetic energy density τ (relative to Thomas-Fermi kinetic energy density τ unif ), and relative spin polarization ζ. Two top rows: XC enhancement over local exchange ϵ unif X , bottom row: pcNN XC enhancement over SCAN XC functional. Reproduced from Ref. [144], DOI: 10.1103/PhysRevResearch.4.013106 under the terms of the Creative Commons Attribution 4.0 International License. Copyright 2022, the Authors. Published by the American Physical Society. Figure 4 : 4 Figure 4: Reaction enthalpies of lowest energetic C 7 H 10 O 2 isomers with respect to the most stable isomer 7-oxabicyclooctan-7-one (depicted in inset). Gaussian-4-Møller-Plesset-2 benchmarks are shown by black bars and B3LYP DFT results by red bars. Blue bars show ∆-ML predictions based on atomic-structural kernels significantly improving over the B3LYP results to within chemical accuracy < 1 kcal/mol. Reproduced with permission from Ramakrishnan et al., 172 DOI: 10.1021/acs.jctc.5b00099. Copyright 2015 American Chemical Society. Figure 5 : 5 Figure 5: Comparison of water molecule charge density differences between coupled cluster theory and PBE (contour plots to the left) and between the NeuralXC functional and PBE (right). Reproduced from Ref. [177], DOI: 10.1038/s41467-020-17265-7 under the terms of the Creative Commons Attribution 4.0 International License. Copyright 2020, the Authors. Published by Springer Nature. Figure 6 : 6 Figure 6: Performance of ML external potential to energy (ML-KS) and external potential to electronic charge density mappings (ML-HK) for H 2 O (all energies in kcal/mol). Top: deviation from PBE-DFT energies as a function of averaged bond length and angles, left for ML-KS, right for ML-HK. Bottom left: errors with respect to PBE-DFT energies for test set geometries. Bottom right: ML-HK potential energy surface of H 2 O with minimum in agreement with PBE-DFT (marked by cross). Reproduced from Ref. [181], DOI: 10.1038/s41467-017-00839-3 under the terms of the Creative Commons Attribution 4.0 International License. Copyright 2017, the Authors. Published by Springer Nature. Figure 7 : 7 Figure7: XC energies evaluated on the analytical exponential densities of hydrogenic ions as a function of the core charge Z. The dashed line marks the exact exchange energy of -5/16 Hartree • Z, which exactly cancels the spurious Hartree interaction in these oneelectron systems. Figure 8 : 8 Figure 8: KS bandstructure of Si: a) computed with the PBE functional; b) and c) computed non-selfconsistently using PBE KS orbitals with the DM21 and DM21mu functionals, respectively. The dashed lines indicate the valence and conduction band edges. While PBE and DM21 significantly underestimate the Si band gap, DM21mu yields a good result of ∼1 eV. Figure 9 : 9 Figure 9:Magnetic moment per primitive body-centered cubic unit cell of bulk Fe obtained with different DFAs: SCAN-L, 200 LSDA, 27 Wu-Cohen, 30 PBE, 102 PBEsol, 29 TPSS, 33 OFR2, 38 MCML, 37 SCAN, 34 mBEEF, 134 pcNN, 144 r 2 SCAN, 201 revM06-L, 35 and HSE06. 202 PBE+U resp result with first-principles Hubbard parameter from linear response from Ref.[58]. HF SR ω=0.4 is short-range screened exchange with the same inverse screening length of 0.4/Bohr as for long-range screened exchange used as input feature in the DM21 functionals. The dashed line indicates an experimental value of 2.13 µ B . 203 Figure 10 : 10 Figure 10: Deviations ∆E ads of DFT transition-metal surface binding energy predictions from experiments (experimental results and PBE-based zero-point energy contributions fromRef.[104]). PBE, VCML-rVV10, SCAN, and results from Ref.[103]. Shown as an example for physisorption is the binding of benzene (C 6 H 6 ) and for chemisorption the binding of carbon monoxide (CO)."
}