{
  "title": "Published at the ICLR 2023 Workshop on Machine Learning for Materials MACHINE LEARNING-ASSISTED CLOSE-SET X-RAY DIFFRACTION PHASE IDENTIFICATION OF TRANSITION METALS",
  "abstract": "Machine learning has been applied to the problem of X-ray diffraction phase prediction with promising results. In this paper, we describe a method for using machine learning to predict crystal structure phases from X-ray diffraction data of transition metals and their oxides. We evaluate the performance of our method and compare the variety of its settings. Our results demonstrate that the proposed machine learning framework achieves competitive performance. This demonstrates the potential for machine learning to significantly impact the field of X-ray diffraction and crystal structure determination. Open-source implementation: https://github.com/maxnygma/NeuralXRD .",
  "introduction": "INTRODUCTION The determination of crystal structure phases from X-ray diffraction data is an important task in materials science, with applications ranging from drug design (Datta & Grant, 2004) to the study of complex materials for hydrogen absorption (Akiba et al., 2006) . It's crucial to address the task of unnecessary phases of elements which can occur in the process of X-ray diffraction. Notably, oxides can occur in the process of synthesis. Traditionally, this problem has been approached through the use of techniques such as direct methods (Duax et al., 1972) and density functional theory (van de Streek & Neumann, 2014) . However, these methods can be computationally difficult to operate with (Burke, 2012) and may not always yield accurate results (Burke, 2012) . In recent years, there has been a growing interest in using machine learning methods to tackle this problem. Machine learning algorithms have the ability to learn patterns and relationships in data, making them well-suited for the analysis of large and complex datasets. They have been applied to a wide range of problems in materials science, including the prediction of material properties (Chibani & Coudert, 2020) and the analysis of imaging data (Wei et al., 2019) . In the context of X-ray diffraction, machine learning has been used to analyze crystal structure and to classify diffraction patterns (Suzuki et al., 2020) .",
  "body": "INTRODUCTION The determination of crystal structure phases from X-ray diffraction data is an important task in materials science, with applications ranging from drug design (Datta & Grant, 2004) to the study of complex materials for hydrogen absorption (Akiba et al., 2006) . It's crucial to address the task of unnecessary phases of elements which can occur in the process of X-ray diffraction. Notably, oxides can occur in the process of synthesis. Traditionally, this problem has been approached through the use of techniques such as direct methods (Duax et al., 1972) and density functional theory (van de Streek & Neumann, 2014) . However, these methods can be computationally difficult to operate with (Burke, 2012) and may not always yield accurate results (Burke, 2012) . In recent years, there has been a growing interest in using machine learning methods to tackle this problem. Machine learning algorithms have the ability to learn patterns and relationships in data, making them well-suited for the analysis of large and complex datasets. They have been applied to a wide range of problems in materials science, including the prediction of material properties (Chibani & Coudert, 2020) and the analysis of imaging data (Wei et al., 2019) . In the context of X-ray diffraction, machine learning has been used to analyze crystal structure and to classify diffraction patterns (Suzuki et al., 2020) . RELATED WORK There has been a significant amount of research in the field of using machine learning for X-ray diffraction (XRD) phase identification. Previous studies (Park et al., 2022; Oviedo et al., 2018; Greasley & Hosein, 2022) have applied various machine learning techniques, such as support vector machines (SVMs), artificial neural networks (ANNs), and k-nearest neighbors (k-NN), to analyze XRD patterns and identify different phases in materials. These methods have been applied to a wide range of materials, including minerals (Greasley & Hosein, 2022) and ceramics (Kaufmann et al., 2020) . However, many of these studies have not focused on transition metal oxides which take an important part in many applications of material science, and there is still a need for more robust and accurate methods for XRD phase identification of these elements. Below, the method for transition metals phases identification based on machine learning and X-ray diffraction patterns is introduced. Firstly, we formulate the general setup of the approach. Then the proposed method is explained as a machine learning problem with regard to implementation details. SYNTHETIC PATTERN GENERATION Initially, the method needs a set of X-ray diffraction patterns X = {x 1 , . . . , x N i } where N is the number of materials. There are 15 materials in the presented setup consisting of transtion metals and variations of their oxides. All of the samples are obtained from he Crystallography Open Database (Gražulis et al., 2009) in the format of cif files. Full list of materials is shown in Table 1 . XRD simulations from molecular structures were obtained using Mercury software (Macrae et al., 2020) . Basic materials Oxides T i, V , Zn, N i, M n, F e, Cr, Co Al 2 O 3 , BaO 2 , CaO, Cu 2 O, Li 2 O, M gO, N aO 3 Table 1: Elements presented in the collected set. Patterns iteratively combined with each other 5 rounds to create a set of synthetic data samples S. Single-material instances are removed from S. Random shift by -1 ≤ 2θ ≤ 1 and intensity scaling with multiplier factor t, 0.5 ≤ t ≤ 1.5 is applied preserving order of phases. Synthetic samples are used to conduct experiments on a more generalized sets of materials as the real-world diffraction patterns may be different in terms of 2θ precision. After combining samples each pattern in X is normalized in the range from 0 to 1. PEAK MATCHING To identify elements presented in a sample of multi-phase diffraction patterns we propose the following peak matching algorithm. Complete overview of the approach can be seen in Figure 1 . 1. Single sample s i ∈ S and reference sample x i ∈ X are selected. 2. Sets of peak locations L x , L s are computed for x i and s i by estimating local maxima m i and m s for every sample. 3. Local minimas between each pair of peaks are calculated, then x i and s i are split on lists P x = {p 1 , . . . , p i }, i = |L x | and P s = {p 1 , . . . , p j }, j = |L s | of parts respectively. 4. Values of P x and P s are clipped below the threshold of 0.1. 5. Areas of P x and P s are calculated using composite trapezoidal rule. For p i ∈ P x the area is obtained from b a p i dx ≈ 1 2 n j=1 (x j -x j-1 )[f (x j-1 ) + f (x j )]. Identical operation is applied for p j ∈ P s . Areas additionally rounded to the 4th figure after the floating point, for other approximation options see Section 4. 6. Acquired areas are measured to find matching values. CALIBRATION MODEL Described framework provides efficient and accurate solution to the problem. However, attempts when the algorithm fails to detect material properly because of overlapping or difficult peaks are not addressed. For this reason, we create an additional support model which uses meta-features obtained from peak matching algorithm to predict materials more precisely. Figure 1 : Peak matching algorithm overview. MODELS Performance analysis is conducted for particular supervised learning and ensemble models: Logistic Regression, Support Vector Machine (SVM), k-Nearest Neighbours (kNN), Decision Tree (DT), Random Forest (RF). All of the models were implemented in Scikit-Learn (Pedregosa et al., 2011) . To evaluate performance precisely, 5-fold stratified cross-validation strategy was used based on equal distribution of samples with positive and negative matches. Features were additionally normalized by removing the mean and scaling to unit variance. Complete list of features used for training is shown below. • The number of peaks calculated by the matching algorithm. • The first index on which the condition s i > 0 is true. • The last index on which the condition s i > 0 is true. • The first index on which the condition x i > 0 is true. • The last index on which the condition x i > 0 is true. • The sum of areas of peaks for multi-phase material. • Target value: is x i presented in s i or not. Table 2: Experiments showcase and their corresponding scores. EXPERIMENTS It's noted that some of the models did not beat the baseline without any additional supervised learning algorithm. Theoretically, this might be due to the fact that peaks positions are hard to learn since they can overlap for different pairs of materials. After careful consideration of hyperparameters, random forest with number of trees -50, increased the maximum depth of the tree to 14 and log loss as the criterion achieves the highest F1 score among other models. Moreover, we have to consider the importance of the rounding value as matching of areas under peaks have significant dependence on it as shown in Table 3 . FUTURE WORK Described method has its own limitations. Close-set phase identification is still might not be accurately performing on real-world scenarios, where pattern and crystal structure may vary due to the number of reasons including but not limited to the state of diffractometer, previous conducted experiments and the flow of the current experiment. For instance, noise reduction and baseline correction techniques might have to be incorporated to handle more complex cases. CONCLUSION In conclusion, machine learning has shown to be a powerful tool for X-ray diffraction (XRD) phase identification. A variety of machine learning algorithms, such as support vector machines, random forests, and k-nearest neighbors, have been applied to analyze XRD patterns and identify different phases in materials by comparing them to a close-set database of XRD patterns. One of the key features used for this analysis is the peak area calculation, which is used to quantify the intensity of the diffraction peaks. This is an important aspect as it allows for more accurate identification of different phases in the XRD patterns. The close-set database of XRD patterns enables the identification to be performed in a more specific and targeted manner, limiting the possibility of misidentification. Presented methods have been effective in identifying phases in small datasets and a limited number of phases, but there is still a need for more robust and accurate methods for XRD phase identification on large datasets. This research highlights the potential of machine learning in XRD phase identification, especially for close-set setups, and suggests directions for future research in this field. Table 3 : 3 Comparison of performance with different rounding points. Rounding point F1 Score 5 0.875 4 0.888 3 0.614 2 0.349 Selected algorithms were trained on data acquired from peak matching. Standard parameters for each model are selected and compared using defined evaluation metrics. Namely, precision, recall and F1-score are used. F 1 = 2 * P recision * Recall P recision + Recall , is essentially the harmonic mean of precision and recall. Since the distribution of classes is highly imbalanced, F1 score addresses this problem as balances between precision and recall. Comparison of mentioned methods can be seen in Table2 ."
}